{"name":"PROFESSIONAL SUMMARY","summary":":\nOver 7+ years of diverse experience as Business Analyst in SDLC, technology implementation in diverse industries namely Telecommunications, Finance, Insurance and Healthcare.","skills":":\nModeling tools\nRational Tools, Erwin 4.1\nMethodologies\nSDLC, RUP,Six Sigma\nProject Management skills/Tools\nRational clear quest, Rational Requisite Pro, MS Project, MS excel, access, Rational test manager, Remedy\nDatabases\nMS access ,SQL server, Oracle, DB2\nOperating systems\nWindows 95/98/2000/2003/XP, Vista\nTesting tools\nMercury interactive: Load runner, win runner, Quick test pro, Test director Rational enterprise suite: Administrator, Test manager","languages":"VB, Java, SAS\nReporting/ETL tools\nBusiness Objects, Crystal Reporting, Informatica, Microstrategy OBIEE,Sybase, Cognos","education":"AL QUALIFICATION\nMS in Chemical and Environmental Engg, IIT-Bombay, India\nBS in Chemical Engg, Pondicherry University, India\nRELATED PROJECTS:\nCox Communications, GA\nSenior Business Analyst/OBIEE August 2009- TillDate\nCox communications is one of the leading companies in providing digital cable television and telecommunications in United States. I was part of the team, which focused on analyzing the consumer behavior trend, I extensively worked on dashboards, generated reports based on the consumer behavioral data, call centre analytics and product promotion functions.","projects":":\nCox Communications, GA\nSenior Business Analyst/OBIEE August 2009- TillDate\nCox communications is one of the leading companies in providing digital cable television and telecommunications in United States. I was part of the team, which focused on analyzing the consumer behavior trend, I extensively worked on dashboards, generated reports based on the consumer behavioral data, call centre analytics and product promotion functions.","objective":"Prepared Business Requirement Documents (BRD) based on the gathered requirements Act as the mediator between client and sales team both in a business and technical capacity.\nCatered to resolving queries from data analysts, client representatives, marketing, and other IT analyst in the product promotion division.\nAnalyze and write test scripts based on functional requirements documents FRD.\nEngage in requirements and gap workshops with clients. Analyze business needs and develop use-case scenarios to aid and facilitate JAD sessions.\nDevelop functional and technical design specifications. Use of process and data modeling techniques.\nAnalyzed and Designed the Data Mart model using Star Schema model with Facts and Dimension Tables\nUsed TOAD for writing SQL queries to perform data analysis.\nDeveloped Reports / Dashboards with different Analytics Views (Drill-Down / Dynamic, Cascading Style Sheets, Pivot Table, Chart, Column Selector, Tabular with global and local Filters).\nConfigured and Created repository using Siebel Analytic Admin tool.\nWorked extensively with Physical Layer, Business Layer and Presentation Layer.\nAnalyzed, Validated consumer behavioral data and generated reports/ Dashboards for the enterprise organization.\nPerformed ETL operations for Business Intelligence reporting solutions, specified the standards for universes, classes, and complex objects in sync with the financial business rules.\nProficient in BMC Remedy Service Request Management (SRM) and Action Request System (ARS).\nPerformed Unit, Integration, and Regression testing to validate report and mapping functionality.\nWorked on HR analytics application metrics and generated reports on various functional issues like Compensation, Retention and Turnover trends.\nPrepared Documentation for OBIEE Repositories and Dashboards designs, test results and standard operating procedures (SOP).\nWorked extensively on marketing analytics, generated reports on the customer satisfaction, product promotion, and call center analytic functions, and presented the results to the project manager.\nConfigured and Scheduled iBots with help of BI Scheduler, OBI Delivers and OBI Presentation services.\nBuilt Business model and established relationships & Foreign Keys (Physical & Logical) between tables.\nCreated Dimensional Hierarchy, Level based measures and Aggregate navigation in BMM layer.\nManaged security privileges for subject area and dashboards according to user requirements.\nHardware/Software:\nMicrosoft Active Directory, Business ObjectsXIr2 , ErWin, Rational Tool Suite, MS SQL Server 2005, MS SharePoint, MS Visio, Windows Server 2000, Oracle 10g Windows NT, , MS Excel, UNIX, OBIEE, Remedy, Testing, Windows XP, 7 Environment\nCapital One, VA April 2008 – July 2009\nSenior Financial Business Systems Analyst/Test Manager\nCapital one is a financial services company ranked among the 20 largest U.S. banking companies. It offers a variety of banking products and financial solutions like personal banking, small business, retail banking, home financing and equity loans, asset management, wealth management, corporate and investment banking and credit card services to its customers. The Small business department provides medium and long-term financing needs of enterprises, with emphasis on small and medium-scale industries. The IT application that the bank wanted to develop was a new web-based loan management system that will provide the employees with extensive product information through a friendly interface.\nAssisted in formulating testing documents like Test Plans, Test Scripts, requirements Traceability matrix (RTM) and Test summary report.\nDeveloped business solutions defining KPIs, reports & dashboards.\nDeveloped Test Cases, Facilitated UAT, compiled results, reviewed and discussed with Business to provide signoff for the Clarity Crystal Reports.\nApplied Erwin, Rational Rose and Power designer for modeling tools.\nEnsured loan accounting documentation was in compliance with bank standards and notified key stakeholders (e.g., Group Managers, Branch Managers) of status.\nDeveloped processes using ETL tools (Data Integrator), SQL to support business reporting requirements.\nWorked on BMC Remedy Service Request Management (SRM) and Action Request System (ARS).\nTested software and computer equipment prior to 'go live' as part of Technology implementation drive.\nConducted Feasibility Study and performed Scope Analysis for the proposed enhancements and gave my recommendations to the Business Users.\nKnowledgeable of various brokerage products, brokerage operations, brokerage platform changes, and working with an aggressive timeline.\nInvolved in the creation and maintenance of the business specification requirement documents, and use case software specification documents.\nPrepared Business Requirement Documents (BRD) based on the gathered requirements.\nDocumented Requirement Traceability Matrix (RTM) in Requisite Pro through test cases.\nAccountable for Margin Lending and risk assessment management, brokerage commissions, brokerage fees, and client engagement management.\nLed and coordinated with the off-shore reporting team of four on a daily basis in completing the reporting requirements using Crystal Reports.\nAct as the mediator between client and sales team both in a business and technical capacity.\nAnalyze and write test scripts based on functional requirements documents FRD.\nEngage in requirements and gap workshops with clients. Analyze business needs and develop use-case scenarios to aid and facilitate JAD sessions.\nDevelop functional and technical design specifications. Use of process and data modeling techniques.\nPrepared Documentation for OBIEE Repositories and Dashboards designs, test results and standard operating procedures (SOP).\nAnalyzed and Designed the Data Mart model using Star Schema model with Facts and Dimension Tables\nUsed TOAD for writing SQL queries to perform data analysis.:\nInvolved in development & documentation of Software Requirements Specification (SRS) using Rational Rose.\nInvolved in JAD sessions with business and technical units.\nInvolved in the design and implementation of web based marketing tools.\nPrepared Use Case surveys, briefs and specification for all the functional requirements identified.\nPrepared Use Case surveys, briefs and specification for all the functional requirements identified (FRD).\nWorked extensively in Visual Basic 6.0, SQL Server, MySQL and MS-Access.\nModeled the detailed design of the system using UML and Rational Rose, Use Case Diagrams, Class Diagrams, Sequence Diagrams and Activity Diagrams.\nHandled requests for proposals, making presentations to customers, and negotiating project timelines and deliverables.:\nEnsured loan accounting documentation was in compliance with bank standards and notified key stakeholders (e.g., Group Managers, Branch Managers) of status.\nAssisted in formulating testing documents like Test Plans, Test Scripts, requirements Traceability matrix (RTM) and Test summary report.\nGathered user and business requirements through interviews, surveys and prototyping. Stored and modified requirements in MS Word.\nApplied Erwin, Rational Rose and Powerdesigner for modeling tools.\nNegotiated the terms with COTS vendors, maintained license and subscription.\nConducted JAD sessions with management, SME, vendors, users and other stakeholders for open and pending issues.\nDeveloped processes using ETL tools (Data Integrator), SQL to support business reporting requirements.\nConducted Change Analysis for the improvement of the existing system and recommended the required changes using Rational Clear Case.\nInvolved in the creation and maintenance of the business specification requirement documents, and use case software specification documents (BRD).\nAnalyzed and prioritized user and business requirements as system requirements that must be included while developing the software.\nPlanned and defined system requirements to Use Case, Use Case Scenario and Use Case Narrative using Rational Rose.\nTested software upgrades and documented results using SharePoint.\nScheduled meetings with developers, system analyst and testers to collaborate resource allocation and project completion using MS Project.\nInvolved in the entire project life cycle (SDLC) from evaluation, installation, configuration and development of end user reports.\nGathered and analyzed the business reporting requirements with the existing Data source and suggested the changes in the data source.\nCreated the universes based on the user classes and their hierarchy in the organization at different aggregations.\nWorked extensively on Siebel applications (Siebel Answers, Delivers, and Dashboards).\nCreated Dashboards by embedding reports and providing intuitive drilldowns and links to exploit the full benefit of Analytics.\nSpecified the standards for universes, Classes, Aliases, Help text, Simple and complex objects.\nIn Info View, implemented customized logins at application level and provided password reset options to the users.\nCreated user groups and managed access privileges using Business Objects Supervisor.\nDesigned, built, and maintained Business Objects universes.\nCreated the Test cases and SQL scripts to verify the results and performed bug tracking using Clear Quest.\nEnvironment: Rational Rose, Rational Clear Case, Rational Clear Quest, MS Office Suite (PowerPoint, VISIO), MS Project, Business Objects 6.5(Supervisor, Designer, Reporter), Broadcast agent server, Erwin 3.5.2, IIS Webserver, DB2, SQL, Oracle 9i, Mercury Test Director, Erwin, Siebel Analytics 7.x, Informatica Power Center 6.x/7.x.\nHealth Alliance Plan, MI January 2005-February 2006\nBusiness System Analyst\nThe purpose of the Insurance Information System program is to create a single, integrated system that will execute the calculation of sales compensation, for both external producers, based on consistent and reliable information captured from pre-determined data sources, improving business processes and controls, ensuring compliance and flexible reporting capabilities. By identifying and aligning source data consistently and processing it through a single calculation engine, commission's payment will not only be timely and accurate, but accountability will also be captured.:\nCreated targeted questionnaires for SME to gather requirements and understand the business process goal from them.\nActively participated in Pre-Testing that included review of the requirement documents, studying the use cases for developing test plans and collection of test data.\nDeveloped routine SAS macros to create tables, graphs, and listings for inclusion in clinical study reports.\nCollaborated with the stakeholders in defining the scope of the project in context to the MMIS (Medicaid Management Information Systems) regulations.\nMonitored day-day activities responsibilities include leading a team of analysts and MMIS specialists in the development of a requirements analysis, advanced planning document and request for proposal.\nWorked closely with other BAs and the BA Lead to get in consensus with the common goal and made collective decisions on critical issues.\nProvided primary liaison between client and development team, providing adequate information to project team for development of application.\nCreated business requirements and helped system analysts in converting them into System Requirement Specification (SRS) document.\nUsed Rational Requisite Pro to document stakeholders' requests, software requirements specifications and traced it to use cases.\nDesigned and Documented Test Procedures and Test Cases for user acceptance, functional and integration testing.\nCreated formula's for Crystal Report and stored it on the Crystal Repository to be used across the organization.\nDiscussed defects with analysts and then made decisions about modifications and changes.\nStudied and analyzed competitor's applications and brainstormed to gather effective requirements for a better quality in the product.\nGave access to end-users for Acceptance Testing and sent defect reports to developers.\nUsed Rational Clear Quest to track defects, while prioritizing them for enhancements after base lining the requirements.\nDocumented Manual Testing and also kept track of defects found during this testing.\nApplied Erwin, Rational Rose and Powerdesigner for modeling tools.\nParticipated in weekly review meetings to report the documented test metrics and defects found in the System.\nUsed Rational Rose and MS Visio to carry out business modeling of the business process.\nPerformed JAD sessions and interacted with stakeholders to discuss problem issues and describing common goal of project.\nVerified business scenarios on new builds to allow extended testing by the QA team and also helped the testing team to expedite User Acceptance and Regression testing to meet the production date.\nResolved issues between front-end developers, middle-tier developers, QA team, and provided suggestions/feedback.\nEnvironment: SQL, Windows 2000, Rational Suite, Visio and MS Project Erwin, MS Office Suite (PowerPoint)\nHousing Development Finance Corporation (HDFC), India October 2002 – December 2004\nBusiness Analyst/ Siebel Analytics Developer\nHousing Development Finance Corporation also called as HDFC is one of the fastest growing banks in India. HDFC launched innovative products on Investment and Retirement products Banking Application. This product helps bankers with Customer Relations by helping decide on the type of retirement benefits to choose. The system was built to transport data from these source systems into one integrated data warehouse, which would allow for storage and reporting.:\nCreated Business Facts & Dimensions and defined Logical relation between them in BMM layer.\nCreated Drill Down Hierarchies and implemented Business Logics for Facts.\nCreated Reports using different Analytics Views (Pivot Table, Chart, Column Selector, Table).\nCreated Pivot Tables and manipulated Init Blocks for report analysis.\nCreated mappings using PL/SQL packages to implement business rules while loading data.\nPerformed performance tuning by optimizing Target, Source, Mapping and Session.\nInvolved in migration of mappings / workflows from Development to Testing and to production.\nCustomized and developed the physical layer, Business Model and Mapping layer and Presentation layer, implemented logical column measures and calculations and to create the reports as per the requirements.\nCreated functional design documents based on the Mortgage LOB approved requirements and supported the Enterprise Interface partners in creating Technical Designs.\nAs a Business Analyst, was involved in the analysis of source data and created detailed Data mapping document between the new servicing system (MSP) and the various middleware and front-end applications.\nWorked on mapping of MSP Web services to Enterprise Interface Partners and coordinated with FIS on MSP Web Services environment access and connectivity related tasks/issues.\nConducted Data analysis including loading data in tables and accessing databases and writing sequel to analyze the data using MS Access and TOAD.\nCoordinated Requirements gathering sessions with the Line of business (LOB) and made sure the requirements were clear and un-ambiguous.\nConducted IT Reviews of the gathered requirements with the Enterprise Interface IT Partners and developed Mock-ups and Wire-frames using Adobe Flex to help them understand it better.\nPlanned and conducted feasibility and impact analysis on the gathered requirements based on resource, timelines, and the budget and helped build the project plan.\nEnsured loan accounting documentation was in compliance with bank standards and notified key stakeholders (e.g., Group Managers, Branch Managers) of status.\nTracked Project Requests in the Enterprise Releases and helped resolve issues/risks arising out of that.\nInvolved in developing Strategies and effectively implementing them for Requirement tracking, Test Planning and Defect Management as the Test Manager for the entire Enterprise Integration team and used Quality Center to achieve the same.\nAs the Test Lead, developed test plan and test scenarios and provided aid to the test team with the build related information, cycling/loading of account data and other technical information via weekly meeting.\nWorked on doing End-to-End testing, and other complex database testing using Toad/ Oracle and supported Black box testing by the LOB.\nWorked extensively on Quality Center all the way from requirements loading, creating/updating test cases and tying them back to requirements, test execution and defect logging/tracking.\nWorked on developing the Implementation plan for the entire Enterprise Integration Team supporting multiple enterprise wide applications during Conversion time-period and supported all the Enterprise applications for a smooth transition from the old to the new system.\nAs part of project close-out activity, was involved in documenting various functional specs for future reference and cleaning-up the WS Data Mapping doc for any errors.\nEnvironment: RUP, Rational Requisite Pro, Clear case, Clear Quest, UML,MS Access, MS Project, MS Excel 2003 and Visio, Siebel Analytics 7.x"}