{"name":"D K","email":"rcobbinah@cobbinah.com","experience":"Morgan Stanley New York, NY\nSenior IT Asset Management Analyst Sept '07 – Present\nResponsible for implementing SAM disciplines and processes for the Asset Management lifecycle.\nInstrumental in the development of STARS (Software Tracking Asset Repository System).\nResponsible management of quarterly and yearly software true-ups (e.g., Microsoft, Adobe, Infragistics, Sage ACT!).\nResponsible for providing senior management monthly and quarterly compliance metrics, forecasting potential audit exposure.\nWork with key stakeholders to define and develop processes for software boarding.\nManage and provision access of software, alignment to appropriate AD groups\nWork with engineering team and application owners with the packaging and scripting of applications.\nWork with sourcing to ensure addendums, agreements and/or contracts are executed when boarding of new and legacy applications\nResponsible for managing Market Data software (e.g., Morningstar Principia, Zephyr StyleAdvisor).\nWork with Service Quality Tools team to ensure the delivery of monitoring desktop alignment and disposition.\nWork with Service Quality Tools team in the implementation of an automated desktop and software inheritance process (e.g., individuals using workstations assigned to terminate employees, individuals transferring and assuming ownership over existing machines).\nMetropolitan Life Insurance Long Island City, NY\nProject Manager, DLM Asset Management (Consultant) Oct '06 – June '07\nProject Manager of all phases PC lifecycle (Desktop & Laptop): Acquisition, Installation, Support, Repair, Refresh, and Disposal.\nIdentify interdependencies between vendors and business units.\nGenerate daily, weekly, monthly dashboard (ad-hoc) reports for senior management and Project Office team members.\nPerform asset management functions, managing and tracking the life cycle of distributed hardware with the use of Peregrine AssetCenter.\nIntegrates key milestones of all streams and manage changes to the project plan.\nManage program issues, decisions, risks, and escalations.\nWork along side Siemens and MetLife Project Offices on resource allocation and any others day-to-day support activity.\nSupport medium to large projects that impact more than one group or LOB.\nProactively identify additional cost-savings and reduce overall expenditures for MetLife DLM program.\nSiemens Business Services (Onsite at Morgan Stanley) New York, NY\nDCIM Project Coordinator Aug '05 – Oct '06\nCoordinated and prioritized network hardware installations, moves, and decommission for Data Center Infrastructure Management.\nManaged and supervised contractor(s) installation process, provide detailed scope and estimates for projects supporting day-to-day infrastructure operations.\nProvide detail of projects to be completed to various groups including (SANOPS, PCSO, UNIXOPS, STORENG, and MCM) for logistics coordination, acquiring work windows for installation of equipment.\nIdentify and monitor projects and infrastructure issues/risk and recommend solutions.\nVerify com-room readiness (power, racks, hardware, and space allocation).\nOpen network configurations (obtain IP addresses, port assignments, and switches).\nProvided ad-hoc operation reports to senior management, compiling reports from end-users, analysts, technicians, and vendors for weekly/monthly status meetings.\nPurchasing Analyst, IT Buyer Dec '03 – Aug '05\nLiaison between Morgan Stanley PMO, business units and vendor(s); ensuring the EDP process was streamlined from requisition to receipt of goods.\nProvided technical analysis on telecommunications equipment, PC hardware, servers, peripherals, and software applications.\nPerformed purchasing functions, with the creation of purchase orders (RFPs, RFQs); provided updates on ETA's, and pricing verification.\nCommunicated with vendors and manufacturers on products, specifications and procurement logistics; billing, invoicing, and reconciliation.\nProcured software and licensing through vendors such as: SHI, Microsoft: FrontPage, Visio, Project, SQL Server. MathWorks: MathLab, Statistics, Financial, Optimization Toolboxes. Quest Software: Toad, Quest Central. Adobe: Acrobat, Photoshop, Flash, Dreamweaver. BEA: WebLogic, Tuxedo. Business Objects: Crystal Reports, BusinessObjects XI.\nProcured hardware equipment through vendors such as: MoreDirect, Dell, IBM (Lenovo), Hitachi, SHI, Hewlett-Packard, NetApp, Cisco, SUN Microsystems, PNY.\nPerform asset management functions, managing and tracking the life cycle of distributed hardware and software, with the use of Peregrine AssetCenter.\nReduced new equipment purchases by 38% by managing all assets and better coordinating equipment needs for hardware and software deployment projects.\nProcurement Systems Analyst Dec '03 – Aug '05\nProvided help desk support for IBuySmart and Ariba Spend Management.\nProvided training, testing and end-user support for day-to-day issues with Ariba functionality.\nCatalog Manager for Ariba EDP catalog. Managed and maintained Ariba master catalog database; updating product description, pricing, mfg. part numbers, commodity codes and supplier part numbers.\nAssisted in the supplier enablement of Morgan Stanley's direct-connect vendors, part of the Ariba Supplier Network (ASN).\nInstrumental with the development and upgrade from Ariba 7.1 to 8.2 (Spend Management). Assisted in creating test scripts, to ensure test data and queries were accurate with expected results. Provided User Acceptance Testing (UAT). Generated ad-hoc reports to developers to review and advise for changes and/or enhancements.\nThe roll-out and deployment of Morgan Stanley's Ariba Spend Management was completed in July of 2005.\nTiffany & Co. Parsippany, NJ\nIT Support Analyst (Consultant) June '03 – Oct '03\nProvided technical/helpdesk support to clients via telephone, email, and voicemail.\nTroubleshoot and resolve end-user's hardware/software issues.\nAdministrating privileges for VPN access to network and resetting end-users passwords.\nSupported Windows 2000, XP & NT platforms, Outlook, Exchange, Internet Explorer 5.5/6.0, MS Office Suites, Novell and proprietary software.\nTroubleshoot IBM POS Registers, JDE One World, and AS/400 applications and network printers.\nMerrill Lynch Jersey City, NJ\nGMI Business Analyst (Consultant) Dec '02 – June '03\nManaged the margin process across Treasuries, Mortgages, Corporate, and Emerging Market Bonds, with use of various AS/400 systems and Solaris applications.\nCommunicated exposure calculations and reconciled trade, exposure and haircut discrepancies.\nBooked free collateral, cash collateral and handled re-pricings of issues, while monitoring the settlement dates, with the use of Bloomberg market data research.\nReported margin call status to the trading desk, credit, risk and operations.\nLiaison between end users and applications development staff, providing level-one technical support; identifying, documenting and resolving AS/400, MS Office Suite application and SUN/Solaris hardware and software issues.\nProvided administrative support and performed duties related to verifying and control of revenues and expenses; mitigate the exposure of the government repossession desk to counter parties.\nResponsible for month-end close activities and reporting actual costs and related planning/forecasting to Senior Management including all variance analysis.\nNational Football League New York, NY\nSystems Administrator (Consultant) May '02 – Oct '02\nMaintained high level of system support (hardware/software) to end-users.\nActed as liaison on behalf of the users, to all system and service providers.\nProvided technical/helpdesk support to clients via telephone, email, and voicemail.\nMaintained the administration of the local area network in the complex, including accurate user's lists with the appropriate access rights to shared resources.\nInstalled/re-imaged desktop operating systems and applications.\nSupported MS Office Suites (Excel, Access, PowerPoint, and Word) Outlook/Exchange.\nInsight Communications Columbus, OH\nHelpdesk Analyst (Consultant) Sept '01 – Feb '02\nTroubleshoot and resolved customers' hardware/software issues with cable modems and connectivity problems.\nConsulted and educated customers on provisioning future technical problems.\nCommunicated with NHD/NOC, routing troubles tickets and follow-ups.\nHandled approximately 30 to 40 calls per day and documented details in Remedy Call tracking database.\nAccount maintenance and administration on Converges & ICOMS database issues.\nProviding 100% 24/7-phone support for technical support for customers'.\nDatek Online Financial Services Jersey City, NJ\nDesktop Support/Helpdesk Analyst Dec '00 – Aug '01\nDesktop support, managed day-to-day computer and networking problems.\nInstall various software applications and configure end-users workstations and laptops.\nRe-imaged, workstations with Norton Ghost software utilities.\nPerformed troubleshooting on dialup networking, modem configuration, and supported Internet applications on Windows 3.x, Windows 98, ME, 2000, Windows NT, and Macintosh workstations.\nProvided technical support to clients via telephone, email, voicemail and administrated privileges for access to networks, resetting passwords to gain access to network servers.\nSAP Analyst/Technical Inventory Coordinator July '99 – Nov '00\nSAP Analyst, Materials Management of Inventory Control.\nAssisted with procurement and supply chain of inventory control, within company and sub divisions.\nSAP Analyst, Accounting Asset Coordinator. Insured and cross-referenced that all assets were in accordance with SAP database and accounting regularities, for quarterly depreciation run.\nTechnical Inventory Coordinator, responsible for purchasing of all technical supply needs for end-users, such as computers, monitors, routers, servers, hubs.\nFormulated Excel spreadsheets with Pivot Tables, Charts & Graphs; cross-referencing physical inventory with SAP database, material master.\nWorked with product specifications, inventory levels, enhancements, and product compatibility.\nMaintained and enhanced relationships with end-user and current vendors.","education":"The Ohio State University, Columbus, Ohio (Matriculating)\nEngineering – Industrial Systems\nColumbus State Community College, Columbus, Ohio\nTechnical Communications\nMetro-Wide Networking Institute, Newark, New Jersey\nClasses for CompTIA A+, MCSE, Networking, CCNA & CCNP"}