{"name":"Gauri","email":"gauri.gohokar@gmail.com","summary":"A progressive Business Analyst commensurate with a Masters Degree in\nBusiness Administration, and over 5 years of experience in business\nprocess analysis/modeling, business requirements gathering.\nStrong knowledge of SDLC, RUP methodology and project life cycle.\nExtensive experience to analyze and document Business Requirements\nand System Functional Specifications including Use Cases.\nProficient in creating UML diagrams such as Use Case Diagrams, Class\nDiagrams, Sequence Diagrams, Collaboration Diagrams, Activity\nDiagrams, State Diagrams, and Deployment Diagrams.\nExpertise in using Rational tools for creating Use Cases, version\ncontrol, and defect tracking and monitoring and used the Rational\nUnified Process (RUP) methodology in all areas of the Software\nDevelopment Life Cycle (SDLC).","skills":"\"Project \"Object Oriented Analysis and Design (OOAD) \"\n\"Management \" \"\n\"Tools/Methodolo\"Unified Modeling Language (UML), Rational Unified Process \"\n\"gies \"(RUP), SDLC, MS Project and MS Visio. \"\n\"Operating \"Linux (FEDORA), UNIX, Win 9X/XP/VISTA and DOS, MAC \"\n\"Systems \" \"\n\"Database \"MS Access, Oracle ,SQL \"\n\"Application \"MS Word, MS Project, MS Excel, Microsoft PowerPoint \"\n\"Tools \" \"\n\"Programming \"C, C++,Java, .NET \"\n\"Language \" \"\n\"Others \"Six Sigma (DIMAC Cycle), SAP-SD(IMG Process and other \"\n\" \"important settings) \"\nProfessional Experience\nWashington Mutual, Seattle, WA\nJan 2010 – Feb 2011\nBusiness Analyst\nWashington Mutual is a diversified financial services company that\nprovides a broad range of banking, asset management, wealth management, and\ncorporate and investment banking products and services. Enhanced their\nwebsite that would enable its customers to login and access their Checking,\nSavings or Ready Reserve accounts. The application provided account\nsummary, facility to transfer funds between various accounts, online bill\npayment etc.\nRoles and Responsibilities:\nAccumulated system requirements from various departments like\naccounting, Human Resource through surveys, interviews and JAD\nsessions.\nCreated Business Requirement Specifications using Rational\nRequisite Pro.\nAnalyzed data to generate information about clients and their\nattributes like institution, site, and buildings. This data was\nstructured and were pushed into tables.\nResponsible for meetings with users and stakeholders to identify\nproblems, resolve issues and to improve the process to ensure a\nstable and accurate solution.\nDesigned paperless item, check numbers and e-bill feature to\nenhance business process.\nDemand deposit accounts setup automatically to adjusted with\ninterest rates when rate changes occur in money market accounts\nlike mortgage accounts, bond accounts\nImplemented Unified Modeling Language (UML) methodologies to\ndesign Context Diagram, Use Case Diagrams, Data Flow Diagrams,\nActivity Diagrams, Sequence Diagram and ER using CASE tools like\nErwin.\nDesigned the look-n-feel or non-functional requirements of the\napplication through Mock-up forms for better illustration of the\napplication to construction managers and field representatives who\nwere based remotely.\nCreated exceptions report which were then submitted to project\nlead and stakeholders on a regular basis.\nUpdated and modified progress and resources allocation in MS\nproject for the team.\nFacilitated user acceptance testing and test strategies with\nInformation Technology Group.\nPerformed manual front-end testing to check all functionalities of\ndifferent modules.\nSuggested measures and recommendations to improve the current\napplication performance.\nEnvironment: Web2.0, Java, , Visual Studio.Net, Word, Microsoft Excel,\nMicrosoft Visio, and MS SQL, MS Access, MS Project\nFirst American Bank, Dallas TX Apr 2009 –\nJan 2010\nBusiness Systems Analyst\nProject involved setting up web enabled access to customers to manage\ntheir mortgage accounts online. The user had to login and then he could\nreview his payment information, view transaction history and make payment\nonline.\nRoles and Responsibilities:\nElicited demands from the stakeholders and analyzed them for\nconsistency, flexibility and completeness. Participated actively in\nassembling the JAD team and in conducting the weekly sessions from\nrequirements gathering phase to the sign-off of the application\nafter testing.\nEfficiently used SQL concepts for removing any redundancy in data\nand for smooth and fast flow of business\nOrganized workshops with Subject Matter Experts to obtain domain\nlevel information. Developed a vision plan that defined the primary\ngoals and objectives of the project.\nIdentified actors and use cases to create use case diagrams that\ndescribed the behavior of the system. Facilitated collection of\nfunctional requirements from system users and preparation of\nbusiness requirement documents using Rational Requisite Pro.\nCreated data, functional and quality requirements.\nInvolved in version control management for storage and\ndistribution of documentation using Rational Clear Case.\nTrained and mentored the team members in RUP and the Rational\nSuite.\nCreated class diagrams, use case diagrams, Business Process\nDiagrams and sequence diagrams to view the system from different\nperspectives.\nCreated the Business Architecture document to provide an overview\nof different aspects of the application. Documented how business\ngoals were reflected in the requirements.\nFollowed the UML based methods using Rational Rose to create: Use\nCases, Activity Diagrams/State Chart Diagrams, Sequence Diagrams,\nCollaboration Diagrams.\nUsed work flow process diagrams and work breakdown structure for\nreducing errors and time efficiency.\nUsed SQL, Toad, Data Warehousing and Data Cleansing for the\narrangement of customer data.\nWrote extensive SQL queries for QA testing and report / data\nvalidation.\nWorked with management to create and communicate critical\ninformation to the user community via email and discussion boards.\nValidated technical designs created by IT developers against\nfunctional specifications. Reviewed system-testing results with the\nproject and technical teams.\nEnvironment: MS Project, Visio, MS Word and MS Excel, Microsoft PowerPoint,\nOracle database.\nU.S. Bank, MN Oct\n2008 – Apr 2009\nBusiness Analyst\nU.S. Bank is a leading financial group which offers traditional\nbanking, investment management, insurance, mortgage, brokerage, etc. The\nproject involved working on a web business portal which aids in servicing\ncompany's customers with their accounts, viewing portfolios, mutual funds\nand other investment prospects for individuals and organizations. The\ncapacity of the project was to create an integrated solution to replace the\nexisting isolated systems.\nRoles and Responsibilities:\nActed as a liaison between the business, data and the technical\nteams throughout the project lifecycle.\nExtracted the business requirements from various sessions with\nbusiness leads and maintained them using Requisite Pro, tracing\nthem all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams,\ncollaboration diagrams and data flow diagrams in UML using Rose and\nMS Visio.\nExcelled in mobilizing the team within the SOA architecture for\nvarious requirements from the business users\nInvolved in identifying Functional and Non-Functional\nrequirements.\nInvolved in GAP analysis in the identification of business rules,\nbusiness and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of\nsystem development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance,\nreliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse\nset of people, platforms and parallel timelines via exceptional\ncommunicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical\nspecifications of other application and modules with Siebel CRM.\nEnvironment: Visual Basic, Oracle 11i, MS-Project, MS-Visio Windows 2000\nServer, Windows 2000, Rational Tools.\nBenelec InfoTech Ltd, India\nJuly 2007 – Dec 2008\nBusiness Analyst / Technical Consultant\nIt provides the IT services and solutions through all the verticals.\nAlso manage the IT systems for the clients. Also develop the\nvarious applications for the clients and provides the training to the\nusers. I was responsible for technical, business and\ncommercial activities involved in the project. I got an opportunity to\nhandle diverse projects through this company.\nRoles and Responsibilities:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS ProjectGroup.\nPerformed manual front-end testing to check all functionalities of\ndifferent modules.\nSuggested measures and recommendations to improve the current\napplication performance.\nEnvironment: Web2.0, Java, , Visual Studio.Net, Word, Microsoft Excel,\nMicrosoft Visio, and MS SQL, MS Access, MS Project\nFirst American Bank, Dallas TX Apr 2009 –\nJan 2010\nBusiness Systems Analyst\nProject involved setting up web enabled access to customers to manage\ntheir mortgage accounts online. The user had to login and then he could\nreview his payment information, view transaction history and make payment\nonline.\nRoles and Responsibilities:\nElicited demands from the stakeholders and analyzed them for\nconsistency, flexibility and completeness. Participated actively in\nassembling the JAD team and in conducting the weekly sessions from\nrequirements gathering phase to the sign-off of the application\nafter testing.\nEfficiently used SQL concepts for removing any redundancy in data\nand for smooth and fast flow of business\nOrganized workshops with Subject Matter Experts to obtain domain\nlevel information. Developed a vision plan that defined the primary\ngoals and objectives of the project.\nIdentified actors and use cases to create use case diagrams that\ndescribed the behavior of the system. Facilitated collection of\nfunctional requirements from system users and preparation of\nbusiness requirement documents using Rational Requisite Pro.\nCreated data, functional and quality requirements.\nInvolved in version control management for storage and\ndistribution of documentation using Rational Clear Case.\nTrained and mentored the team members in RUP and the Rational\nSuite.\nCreated class diagrams, use case diagrams, Business Process\nDiagrams and sequence diagrams to view the system from different\nperspectives.\nCreated the Business Architecture document to provide an overview\nof different aspects of the application. Documented how business\ngoals were reflected in the requirements.\nFollowed the UML based methods using Rational Rose to create: Use\nCases, Activity Diagrams/State Chart Diagrams, Sequence Diagrams,\nCollaboration Diagrams.\nUsed work flow process diagrams and work breakdown structure for\nreducing errors and time efficiency.\nUsed SQL, Toad, Data Warehousing and Data Cleansing for the\narrangement of customer data.\nWrote extensive SQL queries for QA testing and report / data\nvalidation.\nWorked with management to create and communicate critical\ninformation to the user community via email and discussion boards.\nValidated technical designs created by IT developers against\nfunctional specifications. Reviewed system-testing results with the\nproject and technical teams.\nEnvironment: MS Project, Visio, MS Word and MS Excel, Microsoft PowerPoint,\nOracle database.\nU.S. Bank, MN Oct\n2008 – Apr 2009\nBusiness Analyst\nU.S. Bank is a leading financial group which offers traditional\nbanking, investment management, insurance, mortgage, brokerage, etc. The\nproject involved working on a web business portal which aids in servicing\ncompany's customers with their accounts, viewing portfolios, mutual funds\nand other investment prospects for individuals and organizations. The\ncapacity of the project was to create an integrated solution to replace the\nexisting isolated systems.\nRoles and Responsibilities:\nActed as a liaison between the business, data and the technical\nteams throughout the project lifecycle.\nExtracted the business requirements from various sessions with\nbusiness leads and maintained them using Requisite Pro, tracing\nthem all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams,\ncollaboration diagrams and data flow diagrams in UML using Rose and\nMS Visio.\nExcelled in mobilizing the team within the SOA architecture for\nvarious requirements from the business users\nInvolved in identifying Functional and Non-Functional\nrequirements.\nInvolved in GAP analysis in the identification of business rules,\nbusiness and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of\nsystem development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance,\nreliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse\nset of people, platforms and parallel timelines via exceptional\ncommunicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical\nspecifications of other application and modules with Siebel CRM.\nEnvironment: Visual Basic, Oracle 11i, MS-Project, MS-Visio Windows 2000\nServer, Windows 2000, Rational Tools.\nBenelec InfoTech Ltd, India\nJuly 2007 – Dec 2008\nBusiness Analyst / Technical Consultant\nIt provides the IT services and solutions through all the verticals.\nAlso manage the IT systems for the clients. Also develop the\nvarious applications for the clients and provides the training to the\nusers. I was responsible for technical, business and\ncommercial activities involved in the project. I got an opportunity to\nhandle diverse projects through this company.\nRoles and Responsibilities:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project)\nMasters in Business Administration (MBA Systems)","experience":"Washington Mutual, Seattle, WA\nJan 2010 – Feb 2011\nBusiness Analyst\nWashington Mutual is a diversified financial services company that\nprovides a broad range of banking, asset management, wealth management, and\ncorporate and investment banking products and services. Enhanced their\nwebsite that would enable its customers to login and access their Checking,\nSavings or Ready Reserve accounts. The application provided account\nsummary, facility to transfer funds between various accounts, online bill\npayment etc.\nRoles and Responsibilities:\nAccumulated system requirements from various departments like\naccounting, Human Resource through surveys, interviews and JAD\nsessions.\nCreated Business Requirement Specifications using Rational\nRequisite Pro.\nAnalyzed data to generate information about clients and their\nattributes like institution, site, and buildings. This data was\nstructured and were pushed into tables.\nResponsible for meetings with users and stakeholders to identify\nproblems, resolve issues and to improve the process to ensure a\nstable and accurate solution.\nDesigned paperless item, check numbers and e-bill feature to\nenhance business process.\nDemand deposit accounts setup automatically to adjusted with\ninterest rates when rate changes occur in money market accounts\nlike mortgage accounts, bond accounts\nImplemented Unified Modeling Language (UML) methodologies to\ndesign Context Diagram, Use Case Diagrams, Data Flow Diagrams,\nActivity Diagrams, Sequence Diagram and ER using CASE tools like\nErwin.\nDesigned the look-n-feel or non-functional requirements of the\napplication through Mock-up forms for better illustration of the\napplication to construction managers and field representatives who\nwere based remotely.\nCreated exceptions report which were then submitted to project\nlead and stakeholders on a regular basis.\nUpdated and modified progress and resources allocation in MS\nproject for the team.\nFacilitated user acceptance testing and test strategies with\nInformation Technology Group.\nPerformed manual front-end testing to check all functionalities of\ndifferent modules.\nSuggested measures and recommendations to improve the current\napplication performance.\nEnvironment: Web2.0, Java, , Visual Studio.Net, Word, Microsoft Excel,\nMicrosoft Visio, and MS SQL, MS Access, MS Project\nFirst American Bank, Dallas TX Apr 2009 –\nJan 2010\nBusiness Systems Analyst\nProject involved setting up web enabled access to customers to manage\ntheir mortgage accounts online. The user had to login and then he could\nreview his payment information, view transaction history and make payment\nonline.\nRoles and Responsibilities:\nElicited demands from the stakeholders and analyzed them for\nconsistency, flexibility and completeness. Participated actively in\nassembling the JAD team and in conducting the weekly sessions from\nrequirements gathering phase to the sign-off of the application\nafter testing.\nEfficiently used SQL concepts for removing any redundancy in data\nand for smooth and fast flow of business\nOrganized workshops with Subject Matter Experts to obtain domain\nlevel information. Developed a vision plan that defined the primary\ngoals and objectives of the project.\nIdentified actors and use cases to create use case diagrams that\ndescribed the behavior of the system. Facilitated collection of\nfunctional requirements from system users and preparation of\nbusiness requirement documents using Rational Requisite Pro.\nCreated data, functional and quality requirements.\nInvolved in version control management for storage and\ndistribution of documentation using Rational Clear Case.\nTrained and mentored the team members in RUP and the Rational\nSuite.\nCreated class diagrams, use case diagrams, Business Process\nDiagrams and sequence diagrams to view the system from different\nperspectives.\nCreated the Business Architecture document to provide an overview\nof different aspects of the application. Documented how business\ngoals were reflected in the requirements.\nFollowed the UML based methods using Rational Rose to create: Use\nCases, Activity Diagrams/State Chart Diagrams, Sequence Diagrams,\nCollaboration Diagrams.\nUsed work flow process diagrams and work breakdown structure for\nreducing errors and time efficiency.\nUsed SQL, Toad, Data Warehousing and Data Cleansing for the\narrangement of customer data.\nWrote extensive SQL queries for QA testing and report / data\nvalidation.\nWorked with management to create and communicate critical\ninformation to the user community via email and discussion boards.\nValidated technical designs created by IT developers against\nfunctional specifications. Reviewed system-testing results with the\nproject and technical teams.\nEnvironment: MS Project, Visio, MS Word and MS Excel, Microsoft PowerPoint,\nOracle database.\nU.S. Bank, MN Oct\n2008 – Apr 2009\nBusiness Analyst\nU.S. Bank is a leading financial group which offers traditional\nbanking, investment management, insurance, mortgage, brokerage, etc. The\nproject involved working on a web business portal which aids in servicing\ncompany's customers with their accounts, viewing portfolios, mutual funds\nand other investment prospects for individuals and organizations. The\ncapacity of the project was to create an integrated solution to replace the\nexisting isolated systems.\nRoles and Responsibilities:\nActed as a liaison between the business, data and the technical\nteams throughout the project lifecycle.\nExtracted the business requirements from various sessions with\nbusiness leads and maintained them using Requisite Pro, tracing\nthem all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams,\ncollaboration diagrams and data flow diagrams in UML using Rose and\nMS Visio.\nExcelled in mobilizing the team within the SOA architecture for\nvarious requirements from the business users\nInvolved in identifying Functional and Non-Functional\nrequirements.\nInvolved in GAP analysis in the identification of business rules,\nbusiness and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of\nsystem development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance,\nreliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse\nset of people, platforms and parallel timelines via exceptional\ncommunicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical\nspecifications of other application and modules with Siebel CRM.\nEnvironment: Visual Basic, Oracle 11i, MS-Project, MS-Visio Windows 2000\nServer, Windows 2000, Rational Tools.\nBenelec InfoTech Ltd, India\nJuly 2007 – Dec 2008\nBusiness Analyst / Technical Consultant\nIt provides the IT services and solutions through all the verticals.\nAlso manage the IT systems for the clients. Also develop the\nvarious applications for the clients and provides the training to the\nusers. I was responsible for technical, business and\ncommercial activities involved in the project. I got an opportunity to\nhandle diverse projects through this company.\nRoles and Responsibilities:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project","objective":":\nAccumulated system requirements from various departments like\naccounting, Human Resource through surveys, interviews and JAD\nsessions.\nCreated Business Requirement Specifications using Rational\nRequisite Pro.\nAnalyzed data to generate information about clients and their\nattributes like institution, site, and buildings. This data was\nstructured and were pushed into tables.\nResponsible for meetings with users and stakeholders to identify\nproblems, resolve issues and to improve the process to ensure a\nstable and accurate solution.\nDesigned paperless item, check numbers and e-bill feature to\nenhance business process.\nDemand deposit accounts setup automatically to adjusted with\ninterest rates when rate changes occur in money market accounts\nlike mortgage accounts, bond accounts\nImplemented Unified Modeling Language (UML) methodologies to\ndesign Context Diagram, Use Case Diagrams, Data Flow Diagrams,\nActivity Diagrams, Sequence Diagram and ER using CASE tools like\nErwin.\nDesigned the look-n-feel or non-functional requirements of the\napplication through Mock-up forms for better illustration of the\napplication to construction managers and field representatives who\nwere based remotely.\nCreated exceptions report which were then submitted to project\nlead and stakeholders on a regular basis.\nUpdated and modified progress and resources allocation in MS\nproject for the team.\nFacilitated user acceptance testing and test strategies with\nInformation Technology Group.\nPerformed manual front-end testing to check all functionalities of\ndifferent modules.\nSuggested measures and recommendations to improve the current\napplication performance.\nEnvironment: Web2.0, Java, , Visual Studio.Net, Word, Microsoft Excel,\nMicrosoft Visio, and MS SQL, MS Access, MS Project\nFirst American Bank, Dallas TX Apr 2009 –\nJan 2010\nBusiness Systems Analyst\nProject involved setting up web enabled access to customers to manage\ntheir mortgage accounts online. The user had to login and then he could\nreview his payment information, view transaction history and make payment\nonline.\nRoles and Responsibilities:\nElicited demands from the stakeholders and analyzed them for\nconsistency, flexibility and completeness. Participated actively in\nassembling the JAD team and in conducting the weekly sessions from\nrequirements gathering phase to the sign-off of the application\nafter testing.\nEfficiently used SQL concepts for removing any redundancy in data\nand for smooth and fast flow of business\nOrganized workshops with Subject Matter Experts to obtain domain\nlevel information. Developed a vision plan that defined the primary\ngoals and objectives of the project.\nIdentified actors and use cases to create use case diagrams that\ndescribed the behavior of the system. Facilitated collection of\nfunctional requirements from system users and preparation of\nbusiness requirement documents using Rational Requisite Pro.\nCreated data, functional and quality requirements.\nInvolved in version control management for storage and\ndistribution of documentation using Rational Clear Case.\nTrained and mentored the team members in RUP and the Rational\nSuite.\nCreated class diagrams, use case diagrams, Business Process\nDiagrams and sequence diagrams to view the system from different\nperspectives.\nCreated the Business Architecture document to provide an overview\nof different aspects of the application. Documented how business\ngoals were reflected in the requirements.\nFollowed the UML based methods using Rational Rose to create: Use\nCases, Activity Diagrams/State Chart Diagrams, Sequence Diagrams,\nCollaboration Diagrams.\nUsed work flow process diagrams and work breakdown structure for\nreducing errors and time efficiency.\nUsed SQL, Toad, Data Warehousing and Data Cleansing for the\narrangement of customer data.\nWrote extensive SQL queries for QA testing and report / data\nvalidation.\nWorked with management to create and communicate critical\ninformation to the user community via email and discussion boards.\nValidated technical designs created by IT developers against\nfunctional specifications. Reviewed system-testing results with the\nproject and technical teams.\nEnvironment: MS Project, Visio, MS Word and MS Excel, Microsoft PowerPoint,\nOracle database.\nU.S. Bank, MN Oct\n2008 – Apr 2009\nBusiness Analyst\nU.S. Bank is a leading financial group which offers traditional\nbanking, investment management, insurance, mortgage, brokerage, etc. The\nproject involved working on a web business portal which aids in servicing\ncompany's customers with their accounts, viewing portfolios, mutual funds\nand other investment prospects for individuals and organizations. The\ncapacity of the project was to create an integrated solution to replace the\nexisting isolated systems.\nRoles and Responsibilities:\nActed as a liaison between the business, data and the technical\nteams throughout the project lifecycle.\nExtracted the business requirements from various sessions with\nbusiness leads and maintained them using Requisite Pro, tracing\nthem all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams,\ncollaboration diagrams and data flow diagrams in UML using Rose and\nMS Visio.\nExcelled in mobilizing the team within the SOA architecture for\nvarious requirements from the business users\nInvolved in identifying Functional and Non-Functional\nrequirements.\nInvolved in GAP analysis in the identification of business rules,\nbusiness and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of\nsystem development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance,\nreliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse\nset of people, platforms and parallel timelines via exceptional\ncommunicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical\nspecifications of other application and modules with Siebel CRM.\nEnvironment: Visual Basic, Oracle 11i, MS-Project, MS-Visio Windows 2000\nServer, Windows 2000, Rational Tools.\nBenelec InfoTech Ltd, India\nJuly 2007 – Dec 2008\nBusiness Analyst / Technical Consultant\nIt provides the IT services and solutions through all the verticals.\nAlso manage the IT systems for the clients. Also develop the\nvarious applications for the clients and provides the training to the\nusers. I was responsible for technical, business and\ncommercial activities involved in the project. I got an opportunity to\nhandle diverse projects through this company.\nRoles and Responsibilities:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project:\nElicited demands from the stakeholders and analyzed them for\nconsistency, flexibility and completeness. Participated actively in\nassembling the JAD team and in conducting the weekly sessions from\nrequirements gathering phase to the sign-off of the application\nafter testing.\nEfficiently used SQL concepts for removing any redundancy in data\nand for smooth and fast flow of business\nOrganized workshops with Subject Matter Experts to obtain domain\nlevel information. Developed a vision plan that defined the primary\ngoals and objectives of the project.\nIdentified actors and use cases to create use case diagrams that\ndescribed the behavior of the system. Facilitated collection of\nfunctional requirements from system users and preparation of\nbusiness requirement documents using Rational Requisite Pro.\nCreated data, functional and quality requirements.\nInvolved in version control management for storage and\ndistribution of documentation using Rational Clear Case.\nTrained and mentored the team members in RUP and the Rational\nSuite.\nCreated class diagrams, use case diagrams, Business Process\nDiagrams and sequence diagrams to view the system from different\nperspectives.\nCreated the Business Architecture document to provide an overview\nof different aspects of the application. Documented how business\ngoals were reflected in the requirements.\nFollowed the UML based methods using Rational Rose to create: Use\nCases, Activity Diagrams/State Chart Diagrams, Sequence Diagrams,\nCollaboration Diagrams.\nUsed work flow process diagrams and work breakdown structure for\nreducing errors and time efficiency.\nUsed SQL, Toad, Data Warehousing and Data Cleansing for the\narrangement of customer data.\nWrote extensive SQL queries for QA testing and report / data\nvalidation.\nWorked with management to create and communicate critical\ninformation to the user community via email and discussion boards.\nValidated technical designs created by IT developers against\nfunctional specifications. Reviewed system-testing results with the\nproject and technical teams.\nEnvironment: MS Project, Visio, MS Word and MS Excel, Microsoft PowerPoint,\nOracle database.\nU.S. Bank, MN Oct\n2008 – Apr 2009\nBusiness Analyst\nU.S. Bank is a leading financial group which offers traditional\nbanking, investment management, insurance, mortgage, brokerage, etc. The\nproject involved working on a web business portal which aids in servicing\ncompany's customers with their accounts, viewing portfolios, mutual funds\nand other investment prospects for individuals and organizations. The\ncapacity of the project was to create an integrated solution to replace the\nexisting isolated systems.\nRoles and Responsibilities:\nActed as a liaison between the business, data and the technical\nteams throughout the project lifecycle.\nExtracted the business requirements from various sessions with\nbusiness leads and maintained them using Requisite Pro, tracing\nthem all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams,\ncollaboration diagrams and data flow diagrams in UML using Rose and\nMS Visio.\nExcelled in mobilizing the team within the SOA architecture for\nvarious requirements from the business users\nInvolved in identifying Functional and Non-Functional\nrequirements.\nInvolved in GAP analysis in the identification of business rules,\nbusiness and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of\nsystem development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance,\nreliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse\nset of people, platforms and parallel timelines via exceptional\ncommunicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical\nspecifications of other application and modules with Siebel CRM.\nEnvironment: Visual Basic, Oracle 11i, MS-Project, MS-Visio Windows 2000\nServer, Windows 2000, Rational Tools.\nBenelec InfoTech Ltd, India\nJuly 2007 – Dec 2008\nBusiness Analyst / Technical Consultant\nIt provides the IT services and solutions through all the verticals.\nAlso manage the IT systems for the clients. Also develop the\nvarious applications for the clients and provides the training to the\nusers. I was responsible for technical, business and\ncommercial activities involved in the project. I got an opportunity to\nhandle diverse projects through this company.\nRoles and Responsibilities:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project:\nActed as a liaison between the business, data and the technical\nteams throughout the project lifecycle.\nExtracted the business requirements from various sessions with\nbusiness leads and maintained them using Requisite Pro, tracing\nthem all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams,\ncollaboration diagrams and data flow diagrams in UML using Rose and\nMS Visio.\nExcelled in mobilizing the team within the SOA architecture for\nvarious requirements from the business users\nInvolved in identifying Functional and Non-Functional\nrequirements.\nInvolved in GAP analysis in the identification of business rules,\nbusiness and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of\nsystem development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance,\nreliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse\nset of people, platforms and parallel timelines via exceptional\ncommunicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical\nspecifications of other application and modules with Siebel CRM.\nEnvironment: Visual Basic, Oracle 11i, MS-Project, MS-Visio Windows 2000\nServer, Windows 2000, Rational Tools.\nBenelec InfoTech Ltd, India\nJuly 2007 – Dec 2008\nBusiness Analyst / Technical Consultant\nIt provides the IT services and solutions through all the verticals.\nAlso manage the IT systems for the clients. Also develop the\nvarious applications for the clients and provides the training to the\nusers. I was responsible for technical, business and\ncommercial activities involved in the project. I got an opportunity to\nhandle diverse projects through this company.\nRoles and Responsibilities:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project","technology":"Group.\nPerformed manual front-end testing to check all functionalities of\ndifferent modules.\nSuggested measures and recommendations to improve the current\napplication performance.\nEnvironment: Web2.0, Java, , Visual Studio.Net, Word, Microsoft Excel,\nMicrosoft Visio, and MS SQL, MS Access, MS Project\nFirst American Bank, Dallas TX Apr 2009 –\nJan 2010\nBusiness Systems Analyst\nProject involved setting up web enabled access to customers to manage\ntheir mortgage accounts online. The user had to login and then he could\nreview his payment information, view transaction history and make payment\nonline.\nRoles and Responsibilities:\nElicited demands from the stakeholders and analyzed them for\nconsistency, flexibility and completeness. Participated actively in\nassembling the JAD team and in conducting the weekly sessions from\nrequirements gathering phase to the sign-off of the application\nafter testing.\nEfficiently used SQL concepts for removing any redundancy in data\nand for smooth and fast flow of business\nOrganized workshops with Subject Matter Experts to obtain domain\nlevel information. Developed a vision plan that defined the primary\ngoals and objectives of the project.\nIdentified actors and use cases to create use case diagrams that\ndescribed the behavior of the system. Facilitated collection of\nfunctional requirements from system users and preparation of\nbusiness requirement documents using Rational Requisite Pro.\nCreated data, functional and quality requirements.\nInvolved in version control management for storage and\ndistribution of documentation using Rational Clear Case.\nTrained and mentored the team members in RUP and the Rational\nSuite.\nCreated class diagrams, use case diagrams, Business Process\nDiagrams and sequence diagrams to view the system from different\nperspectives.\nCreated the Business Architecture document to provide an overview\nof different aspects of the application. Documented how business\ngoals were reflected in the requirements.\nFollowed the UML based methods using Rational Rose to create: Use\nCases, Activity Diagrams/State Chart Diagrams, Sequence Diagrams,\nCollaboration Diagrams.\nUsed work flow process diagrams and work breakdown structure for\nreducing errors and time efficiency.\nUsed SQL, Toad, Data Warehousing and Data Cleansing for the\narrangement of customer data.\nWrote extensive SQL queries for QA testing and report / data\nvalidation.\nWorked with management to create and communicate critical\ninformation to the user community via email and discussion boards.\nValidated technical designs created by IT developers against\nfunctional specifications. Reviewed system-testing results with the\nproject and technical teams.\nEnvironment: MS Project, Visio, MS Word and MS Excel, Microsoft PowerPoint,\nOracle database.\nU.S. Bank, MN Oct\n2008 – Apr 2009\nBusiness Analyst\nU.S. Bank is a leading financial group which offers traditional\nbanking, investment management, insurance, mortgage, brokerage, etc. The\nproject involved working on a web business portal which aids in servicing\ncompany's customers with their accounts, viewing portfolios, mutual funds\nand other investment prospects for individuals and organizations. The\ncapacity of the project was to create an integrated solution to replace the\nexisting isolated systems.\nRoles and Responsibilities:\nActed as a liaison between the business, data and the technical\nteams throughout the project lifecycle.\nExtracted the business requirements from various sessions with\nbusiness leads and maintained them using Requisite Pro, tracing\nthem all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams,\ncollaboration diagrams and data flow diagrams in UML using Rose and\nMS Visio.\nExcelled in mobilizing the team within the SOA architecture for\nvarious requirements from the business users\nInvolved in identifying Functional and Non-Functional\nrequirements.\nInvolved in GAP analysis in the identification of business rules,\nbusiness and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of\nsystem development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance,\nreliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse\nset of people, platforms and parallel timelines via exceptional\ncommunicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical\nspecifications of other application and modules with Siebel CRM.\nEnvironment: Visual Basic, Oracle 11i, MS-Project, MS-Visio Windows 2000\nServer, Windows 2000, Rational Tools.\nBenelec InfoTech Ltd, India\nJuly 2007 – Dec 2008\nBusiness Analyst / Technical Consultant\nIt provides the IT services and solutions through all the verticals.\nAlso manage the IT systems for the clients. Also develop the\nvarious applications for the clients and provides the training to the\nusers. I was responsible for technical, business and\ncommercial activities involved in the project. I got an opportunity to\nhandle diverse projects through this company.\nRoles and Responsibilities:\nRequirements Gathering through JAD sessions, interviews and\nworkshops with clients, developers, and QA Analysts.\nWriting Use Cases and developing Unified Modeling Language (UML)\nand Data flow diagrams (DFD) for all the System Life cycle\ndevelopment (SDLC).\nManaged detailed project plans which included resources planning,\ntasks planning, budgeting, milestones set-up, and performed Gap\nAnalysis, Impact Analysis, SWOT Analysis, Cost Benefit Analysis &\nRisk Analysis.\nHosted Vender selection process and created Vendor Analysis\nDocument.\nInvolved in training the end users. Documented Training Manuals\nfor new product release.\nTo guide marketing team and to complete Sales cycle.\nAssist MD for company presentations and also to handle events.\nClient Name: MIT Educational Institute, India\nBusiness Analyst\nCentralizing IT Infrastructure\nThis project was centralizing the IT management System. Institute also\nwants to to upgrade to the Windows Vista® operating system and the 2007\nMicrosoft® Office system to simplify desktop management, enhance security,\nand boost employee efficiency. They want to connect all the geographical\nlocations centrally by combining the Active directories, going for\nVirtualization.\nRoles and Responsibilities:\nPlanned the project time-line and scheduled various project\ndeliverable dates according to the various phases of the project.\nAllocated appropriate funds for recourses and was effectively\ninvolved in submitting cost sheet ever month.\nTactfully delegated work to the sales team and technical team.\nEffectively conducted JAD/JRP sessions, meetings and conferences\nwith end users for Gathering Requirements for FRD (Functional\nRequirements Document).\nOrganized meetings with the development and QA teams to elicit Use\nCases and document them.\nKept user up to date with the current status of the project,\ntimeline and budget of the project.\nEnsured that the information was updated on a weekly basis, the\ninformation was accurate, and was documented in a clear, concise\nmanner to facilitate project reporting to the upper management.\nFollowed TQM (Total Quality Management) methodology for quality\ncontrol.\nCreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application using MS Visio.\nGenerated Unified Modeling Language (UML) diagrams such as\nActivity, State Transition, Sequence Diagrams and Workflow Diagram\nto demonstrate critical processes using MS Visio.\nUsed SQL queries for data validation.\nInvolved in Trouble Shooting by checking each system requirement\none by one and also test results.\nCreated User Manuals and actively conducted walk-through sessions\nwith the end users.\nResponsible and involved till the final deployment of the system\nEnvironment: SDLC Methodology, Windows Vista, MS Access, SQL, MS Project\nand Microsoft PowerPoint.\nClient Name: Mather & Platt Pumps Ltd, India\nBusiness Analyst\nOrganizing Datacenter\nThe company wanted to build the data center in the organization.\nBuild different servers as per applications and manage the IT\ninfrastructure centrally. Company wanted to have the security solution for\nthe desktop and also wanted to go for virtualization.\nRoles and Responsibilities:\nArranged meetings and conferences with end users for gathering\nrequirements.\nConducted JAD/ JRP sessions to collect the software requirements\nspecifications (SRS) and used RequisitePro to document the\nrequirements.\nUsed Rational Unified Process as the development methodology,\ncreated Use Cases and Use Case Diagrams to define the Functional\nrequirements of the application.\nCreated Unified Modeling Language (UML) diagrams such as Activity,\nState Transition and sequence diagrams to demonstrate critical\nprocesses.\nCreated Requirements Traceability Matrixes (RTMs) to support the\napplication development that included Business Requirements, Actor\nSurvey, Use Case Survey, Supplementary Specification Survey,\nAnalysis Model, Design Artifacts and Test Case Survey.\nOrganized meetings with the development teams to elicit use cases\nand document them\ninteracted with the development team and executive team to liaison\nthe business requirements to ensure that the application under\ndevelopment confines to the business requirements.\nCreated queries from databases to validate data in the reports\nusing SQL.\nWork closely with the support team to document how they solve all\nbugs & quires came from users, with the workflow diagrams and\nnarratives.\nMaintained different versions of the project.\nMaintained and controlled track of stakeholders requests for\nenhancements and changes.\nConducted walkthrough with the development team and stakeholders\nusing slide presentations\nanalyzed the security implementation of the application with\nrespect to users' perspective.\nInvolved in UAT, executing test cases, evaluating test results and\npreparing test summary reports.\nUsed Test Director to report bugs to Developers and Project\nManagers to resolve defect related issues.\nJointly responsible for monitoring the progress of the development\nand QA teams.\nAnalyzed defects reported in test director and assigned them to\nthe technical team to fix the same\nInvolved in training and documentation of for new product release\nEnvironment: MS-Office, MS Project, Microsoft FrontPage, MS Excel, MS\nAccess, Client Server, Oracle Server\nB.P.ERGO, India June 2006-June\n2007\nBusiness Analyst\nImplementing Management Information System\nThe project I worked for the developing and implementing the\n\"Management information System\" throughout the B.P.ERGO network using\nEXTRANET. This application was mainly for the online order processing. To\nmaintain the sales order process like placing order, dispatch, Inventory\nmanagement, revision on project.\nRoles and Responsibilities:\nWorked in full SDLC Lifecycle using Rapid Application Development\n(RAD) methodology.\nAided in coordination and development of project requirement\ngathering and documentation using Caliber RM tool, MS Word and MS\nExcel.\nConducted group discussions to gather requirements in JAD sessions\nwith the User group and development teams and documented scope and\nbusiness requirement, Functional Specifications and created User\nInterface Mockups/Prototypes.\nInterfaced with SMEs to prepare comprehensive BRDs for major\ninitiatives related to the on-going projects.\nPrepared business process models and followed UML based methods\nusing MS Visio to create Use Case diagrams, Activity Diagrams, and\nState Chart Diagrams.\nDeveloped Use Cases, workflow, screen mock-ups and conversion\nrequirements. Followed UML approach to organize requirements and\ngrouped into business processes, business rules, information needs\nand ensured that critical requirements are not missed.\nWorked closely with the Development team to clarify system\nrequirements\nAssisted the development team during design, build and test phase\nof the system to crystallize the business requirements when needed\nSuccessfully conducted the UAT and provided post production\nsupport\nIdentified the impacted QA area for testing and defined the user\nrole and specific data to be used for testing\nProvided examples of specific set up needs, clients or groups,\ntypes of order or invoices, user roles or any special circumstances\nwhich should be included in the QA scenarios to fully validate the\nbusiness objectives of the requirement.\nEnvironment: VB.NET, XML, SOA, web2.0, Java, , Visual Studio.Net, Microsoft\nWord, Microsoft Excel, Microsoft Visio, and MS SQL, MS Access, MS Project)\nMasters in Business Administration (MBA Systems)","education":"Bachelors of Engineering (Information Technology)\nMasters in Business Administration (MBA Systems)","certification":"s\nSun certified in Java.\nDone certification in programming languages C, C++.Sun certified in Java.\nDone certification in programming languages C, C++."}