{"name":"Sooraj Mattappadan","email":"soorajmatt@gmail.com","mobile":"412-980-6055","summary":"Facilitator between Business Systems and Information Technology with over 8 years of extensive experience in the field of business analysis and project management.","experience":"with Business Process Management.\nA motivated, committed, quick learning, detail-oriented team player with good communication, analytical, leadership, interpersonal and problem solving skills\nAREAS OF EXPERTISE\nOperating Systems: Win 98/XP/Vista/Windows 7, UNIX, LINUX, Mac.","objective":"Gathered requirements and prepared Charter, Business Requirement Documents (BRD), System Requirement Specification (SRS) by interviewing Business Users/SME's.\nUsed RequisitePro for writing/analyzing project vision, goals, specifications and requirements.\nConduced Joint Application Development (JAD) sessions and walk in interview with the business users to gather requirements.\nCreated Use Cases diagram and Activity diagram to depict the interaction between the various actors and the system in RationalRose for the Business Use Case and System Use Case.\nUsed HIPAA 4010 transactions to support the analysis of current business processes and work with management to improve and implement enterprise solutions to ensure compliance and got involved in designing future state processes for HIPAA 5010 transaction processing EDI's 837,835, 270, and 271.\nAnalyzed HIPAA 5010 related to 837,835, 270, and 271. Transactions and performed gap analysis between the 4010 and 5010.\nResponsible for GAP analysis of ICD9-ICD10.\nDocumented the Business Process Flows, Business Use Cases, System Use Case, Business Rules and Use Case Realization following the Rational Unified Process (RUP) methodology.\nTagged and traced the created artifacts (Business Use Cases, System Use Case, Business Rules and Use Case Realization) in RequisitePro, making requirements available to all team members.\nMaintained Requirements Traceability Matrix in Rational RequisitePro and used ClearQuest to manage change requests and track defects.\nCreated documents like the Business Glossary to facilitate the other teams in understanding client business in RequisitePro.\nUsed Microsoft SharePoint to manage the documents and have version control.\nAnalyzed the business requirement as per the HIPAA rules and regulations.\nAdhered data transition of the payment and remittance advice as per the EDI standard 835.\nWorked on different EDI scenarios for batch processing.\nRun EDI Reconciliation reports daily and documented them\nEnsured day-to-day- EDI transmission, reject tracking and reconciliation.\nCreated maintenance reports and spread sheets for analysis purposes using Microsoft Excel.\nEnvironment: J2EE, UML, RUP, Rational RequisitePro, RationalRose, Rational ClearQuest, Excel, SQL, DB2, Crystal Report, Mercury Load Runner, SharePoint.\nTufts Health Plan, Watertown, MA May 2007 - Dec 2008\nBusiness Analyst\nTufts Health Plan offers range of health care coverage options to individuals and through employer groups. The project involved building a Enterprise SOA(service-oriented architecture) based system that will be developed on the Microsoft .NET Platform. The new Claims Processing MMIS (Medicaid Management Information System) will replace the old legacy system thereby automating all the business areas with minimum human intervention. As a Business Analyst, I was involved with drafting the migration plan for the Claims Processing data which needed to be migrated from the Mainframe to the SQL Server environment.:\nConducted requirement gathering sessions with the Information Technology team\nAttended JAD sessions for Requirement Validation to gather requirements for the new MMIS.\nFollowed a structured approach to organize requirements into logical groupings of business processes and information needs\nPerformed an analysis of requirements so that they are in compliance with HIPAA.\nDeveloped Use Cases, Activity diagrams and Sequence diagrams from the requirements based on the UML methodologies using MS-Visio\nInvolved in the design and development of User Interfaces (UI) using HTML, JavaScript and JSP\nHeld periodical meetings with the Development team to gather information on the progress and resolve project issues\nUsed Microsoft SharePoint as the version tracking tool for managing the requirements documentation.\nRequirement Traceability Matrix was maintained through RequisitePro to keep the timelines and milestones in check.\nHelped the testing team in carrying out manual testing and also assisted in writing test cases and a Test Plan.\nTested the final application for Usability testing to verify whether all the User Requirements were catered to by the application.\nBugs that would enhance the usability of the application were logged using Rational ClearQuest.\nInteracting with the developers on resolving the reported bugs and various technical issues.\nInvolved in preparing a simple and detailed User manual for the application, for an intended novice user.\nTested the features and functions based on priority using Rational Quality Manager.\nEnvironment: Rational RequisitePro, Rational Rose, UML, MS-Project, MS Visio, Java, MS Office, Windows XP, Microsoft SharePoint, RQM\nHarris Direct, Phoenix, AZ Jan 2005 — April 2007\nBusiness Analyst\nHarris Direct LLC is a broker dealer and is a subsidiary of Bank of Montreal. The project was to build an online trading portal so as to facilitate the trading process. As a business analyst, I had been involved in working with the user group to create Business requirement documents, work flows, use cases and working on the front end UI of the portal. The job profile also entails coordination with the on-site and off-shore development teams so as to bridge various gaps and functional requirements.Responsible for developing the workflows, design and back-end integration with Pershing systems.\nDesigned and authored Business Requirement Documents, Functional Specifications and Technical maps.\nWorked on developing the current workflows and mapping the requirements for the functioning of front office systems.\nResponsible for understanding the current process and developing potential workflows for distribution of New Issues (Initial Public Offerings).\nWorked on different types of Mutual Funds and their back end integration with Pershing Systems.\nWorked on the functional specifications for the IPO's and managing its integration into the Pershing Back-end tool.\nWorked on handling Variable Securities, Stocks and Derivatives, Options databases.\nUnderstanding various methods involved for IPO distribution (Auction, Traditional etc.) and developing the use cases and workflow diagrams.\nWorked on the account management section. Balance sheets, G/L ledger, trial balance.\nGathered Business Requirements for building a centralized reference data repository firm-wide and for alignment of data between old and new systems and data from data vendors; prepared Business Requirements Document.\nReconciled and analyzed product & pricing reference data for stocks, funds, preferred stocks, convertibles, and equity derivatives, originating from data vendors and internal systems.\nCoordinating with Pershing so as to integrate the front end systems to their back end NetEx services.\nResponsible for integration of Wall Street on Demand and NASDAQ Level II streaming quotes with the front end systems.\nIdentifying entitlements and access issues pertaining to specific streams and user groups and their touch points with other systems.\nEstablish alternate sources of reference data.\nMonitor and validate incoming counterparty reference data cleansed by an external vendor\nProvide overall leadership to establish and maintain quality reference data for a global counterparty data repository.\nResponsible for identifying various business needs and requirements and presenting them to the user.\nDeveloped Use Case diagrams, Activity Diagrams and Sequence Diagrams.\nAnalyzed and discussed the business and functional requirements for the application under construction.\nReference data specifications were created and described in a way that is commonly understood.\nReference data was maintained with the highest level of accuracy.\nWorked with the quality assurance team so as to test different releases and to develop test plans and test cases.\nMapped functional and business requirements.\nResponsible for communications between the off-shore development team and onsite Project Team and other related departments.\nInvolved in UAT, test plans, documentation of test reports etc.\nInvolved in the system work flow analysis and contributed to the overall work flow diagram for the website.\nEnvironment: Java, C#, VB.net, XML, Rational Requisite Pro, Rational Unified Process, UML, UNIX, Visio, MS Project, SQL Navigator, Win Runner, Test Director.\nCharter One Bank / Citizens Bank, Buffalo, NY Dec 2002 - Dec 2004\nBusiness Analyst\nI worked at multiple projects at Charter One Bank / Citizens Bank: facilitating asset management and portfolio decisions, providing risk analysis requirements, looking into different aspects of a merger, providing newer areas of expansion of clientele and increasing future profitability.:\nParticipated in structuring, underwriting and documentation of credit facilities.\nFacilitated in compiling and structuring data using SQL.\nDocumented financial and industry analyses to support portfolio decisions.\nAuthored Business Requirement Document (BRD) for development of software to support Black & Scholes Model, CAPM, and Sharpe Ratio for investment decisions, in keeping with risk regulations that were in place.\nMonitored bank's credit risk exposure to its new and existing clients.\nPeriodically reassessed and updated internally assigned risk ratings.\nConducted ROI analyses for competing portfolio candidates.\nEvaluated risk-return ratio to facilitate most efficient allocation of capital.\nIntroduced newer areas of clients that could be nurtured for long term deposit flows.\nIntroduced newer ways of competing with existing big banking institutions.\nDeveloped models to determine the effects of possible mergers with other banks.\nConducted JAD sessions with merger and acquisition (M&A) SMEs, the management of charter one, and research and management teams of other banks.\nLed a team of 10 business analysts and liaised with another team of 12 business analysts during the period of merging of charter one bank and citizen's bank.\nPrepared documents and conducted interviews and JAD sessions to facilitate a smooth transition during merger.\nDocumented changes that needed to be done before, during and after possible mergers\nDocumented website availability and availability of dashboard reporting and other resources before, during and after merger.\nIntroduced banking procedures to business analysts and other members of merged entity.\nPerformed data analysis and gap analysis to keep projects on track.\nHelped in user acceptance tests (UAT) and other tests.\nAuthored user manuals for customers of merged entity.\nWas instrumental in a smooth transition of entity, and in a much broader client base.\nEnvironment - MS SQL Server, Informatica Power center, Mercury Quality Center, MS Word, MS Excel, Clear Quest, Clear Case, Windows XP\nAzima Health Services, Dallas Texas Jan 2002 - Nov 2002\nBusiness Analyst\nAzima Health Services is a provider of innovative revenue cycle automation and outsourcing solutions to the healthcare industry. Azima has combined best of breed software, rigorous business processes, and highly skilled reimbursement specialists to create the most advanced array of revenue cycle automation and management solutions in healthcare. Azima provides its client partners with access to these solutions via the Internet on an as-needed, pay-as-they-go basis. The main purpose of this project was to maintain patient related information and help Account Receivable Team to increase the collection from insurance companies. Also, help in the tracking a medical claim, sending it to the insurance companies, follow up and closing of the claim as per HIPAA compliance.:\nRequirements gathering from various insurance companies to develop a system to check for the outstanding balance from various accounts using highly efficient RUP process of software development.\nLiaison between the Business needs (business users and sponsor) and the Technical solutions (development and testing staff), ensuring technical solutions satisfied business requirements.\nWeb Page Mock-Ups using MS Visio and thus defining the Business Process Model and Data Process Model.","education":"BS Computer Science, North Dakota State University, USA"}