{"name":"Business Analyst","email":"rajat@ar-sys.com","mobile":"732-321-9227","summary":":\nA progressive Business Analyst commensurate with a Masters Degree in Business Management, and over 5 years of experience in business process analysis/modeling, business requirements gathering.\nStrong Knowledge of SDLC, RUP methodology and project life cycle.\nExtensive experience to analyze and document Business Requirements and System Functional Specifications including use cases.\nSuccessful in translating business requirements and user expectations into detailed specifications employing Unified Modeling Language (UML) using Rational Rose & MS Visio.\nExpertise in using Rational tools for creating use cases, version control, and defect tracking and monitoring and used the Rational Unified Process (RUP) methodology in all areas of the software development life cycle (SDLC).","experience":":\nHartford Insurance, Hartford, CT Dec 2006 - Present\nBusiness Analyst\nThe Hartford Insurance is one of the largest investment and insurance companies in the United States. The Hartford is a leading provider of investment products, life insurance and group and employee benefits; automobile and homeowners products; and business insurance. The company is the largest seller of individual annuities in the U.S. and has been a provider of auto and homeowners insurance to members of AARP.\nThe project involved developing comprehensive online requests for auto insurance quote processing.","objective":":\nPrepared use case models based on Business Requirement documentation gathered through interaction with users.\nWorked throughout the SDLC, which included requirements, specifications, design, analysis and testing utilizing RUP methodology.\nPerformed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.\nInvolved in creating and enhancing requirements, analysis and design using Rational Tools (Rational Rose, Rational Requisite Pro, Rational Clear Case, and Clear Quest).\nCreating user requirements document for company wide reports by interacting with end users and developers.\nInteract with the developers and defined the needs to update the design of the Graphical User Interface.\nParticipated in various meetings and discussed Enhancement and Modification Request issues.:\nGathered and documented customer requirements, detailed functional design specifications and system documentation\nCreated and maintained all related procedural documentation\nDocumented Business processes in terms of customer service and feedback\nAssisted project management with technical and support process development.\nGained commitment from stakeholders to enter new applications into production\nOversaw requirements traceability and issue resolution.\nAssisted in designing test plans, test scenarios and test cases for integration, regression and user acceptance testing\nEnvironment:\nMS Project, Visio, MS Word and MS Excel.\nCommerce Bank, Pittsburgh, KS\nBusiness Analyst Nov 04 – Jun 05\nCredit Card Authentication systems for Loan payments\nCommerce Bank is the principal subsidiary of Commerce Bancshares Inc., a $13.9 billion regional bank holding company. For more than 140 years, Commerce has been meeting the financial services needs of individuals and businesses and offers broad range of lending, deposit and membership based products. Commerce offers online services such as 24-hour online account access to credit card accounts, instant online account opening for deposit accounts, instant decisions for Aria visa, Providian (Visa and Master) credit cards and loan comparisons. Project CAS (Card Authentication Systems): 24-hour online access to repay, where customers can login and view their account information. They can make online payments, change their contact information and contact customer service representatives for questions.:\nInvolved in defining scope of the project along with vision statement.\nAccumulated customer requirements from various end users through surveys, interviews and JAD sessions.\nCreated functional, technical and system requirement documents for trading system.\nResponsible for meetings with users and stakeholders to identify problems, resolve issues and improve the process to ensure a stable and accurate solution.\nApplied Unified Modeling Language (UML) methodologies to design Use Case Diagrams, Activity Diagrams, and Sequence Diagram in Rational Rose.\nCreated use-case scenarios and storyboards in MS Word and MS PowerPoint for better visualization of the application and managed them using Rational Requisite Pro.\nGenerated reports for analyzing various investments and their profitability and also for analyzing various lost opportunities due to time delay in investing.\nWorked with the team on security features: web, encryption, authentication and SSO possibilities\nCreated test plans and scripts, facilitated user acceptance testing and tested strategies with developers and testers.\nPerformed manual front-end testing to check all functionalities of different modules using Test Director.\nEnvironment:\nRUP, UML, Use Cases, MS Visio, MS Excel, MS Project, Workflow\nWashington Mutual Seattle, WA Feb 2004 - Sep 2004\nBusiness Analyst\nWashington Mutual is a diversified financial services company that provides a broad range of banking, asset management, wealth management, and corporate and investment banking products and services.\nEnhanced their website that would enable its customers to login and access their Checking, Savings or Ready Reserve accounts. The application provided account summary, facility to transfer funds between various accounts, online bill payment etc.:\nAccumulated system requirements from various departments like accounting, Human Resource through surveys, interviews and JAD sessions.\nCreated Business Requirement Specifications using Rational Requisite Pro.\nAnalyzed data to generate information about clients and their attributes like institution, site, and buildings. This data was structured and were pushed into tables.\nResponsible for meetings with users and stakeholders to identify problems, resolve issues and to improve the process to ensure a stable and accurate solution.\nDesigned paperless item, check numbers and e-bill feature to enhance business process.\nDemand deposit accounts setup automatically to adjusted with interest rates when rate changes occur in money market accounts like mortgage accounts, bond accounts\nImplemented Unified Modeling Language (UML) methodologies to design Context Diagram, Use Case Diagrams, Data Flow Diagrams, Activity Diagrams, Sequence Diagram and ER using CASE tools like Erwin.\nDesigned the look-n-feel or non-functional requirements of the application through Mock-up forms for better illustration of the application to construction managers and field representatives who were based remotely.\nCreated exceptions report which were then submitted to project lead and stakeholders on a regular basis.\nUpdated and modified progress and resources allocation in MS project for the team.\nFacilitated user acceptance testing and test strategies with Information Technology Group.\nPerformed manual front-end testing to check all functionalities of different modules.\nSuggested measures and recommendations to improve the current application performance.\nEnvironment:\nOracle 9i, HTML, Rational Rose, MS Visio, RUP, MS Project, SQL, Erwin 4.1, MS Access, MS Excel and MS Word\nWestfield Insurance, OH Aug 2003 - Dec 2003\nBusiness Analyst\nProject: Online insurance system:\nPrepare business process flow diagrams and perform use case analysis.\nAssist in Effort Estimation, Planning, task Scheduling, Tracking and Requirements Management.\nUse RUP and UML methodologies and Requisite Pro tool to design, document, and manage requirements throughout the lifecycle of the project.\nAct as an important liaison between the various business units and be cross-functional.\nWork with developers, testers, business users, stakeholders at various levels on different stages of the SDLC.\nAssist in designing test cases, writing Validation Rules and also participate in User acceptance sessions.\nEnvironment:\nMS Project, RUP, UML, Requisite Pro, M S Visio, Word, PowerPoint and MS Excel.\nClient: HDFC Bank, Mumbai, India Dec 2002- June 2003\nRole: Business Analyst\nProject Description: The Business need for this project was to develop an automated web based system for the process of recording and maintenance of reports from the credit card companies. The system generates Credit reports of individuals based on the data provided by the various agencies. The system also maintains a record of any information obtained to an individuals report and updates the database.:\nParticipated in gathering user requirements, developing functional and non-functional requirements and technical specifications.\nDeveloped use cases/diagrams, conceptual model, behavior diagrams (sequence, -collaboration, state chart, Activity), using MS Visio.\nResponsible for working with the manager and other users and creating Work flow diagrams as per the data analysis.\nResponsible for the delivery of Business Requirements Documents (BRD) within project timelines.\nWork with the Technical Analyst and development team to ensure that they understand the specifications.\nExtensively involved in coming up with test specifications, test cases and test manuals for the application.\nPerformed unit testing, functional testing, integration testing, stress testing and code inspection review to make sure the deliverables are match with business requirement.\nEnvironment:\nWindows 98,MS Project, MS Visio, Visual Basic, Crystal Report, Win Runner, HTML, MS Office, SQL.","education":"Masters of Business Administration (MBA)\nDiploma in Business Management (DBM)\nMasters in Commerce (M.COM)\nREFERENCES: Provided upon request"}