{"name":"ARUN KUMAR","email":"ahlawat.arun@gmail.com","mobile":"608-320-5810","summary":"Business Analyst with 7 years of experience in business analysis, system analysis and design.\nExtensive experience to analyze and document Business Requirements and System Functional Specifications including use cases.\nProficient in translating business requirements and user expectations into detailed specifications employing Unified Modeling Language (UML) using Rational Rose & MS Visio.\nExpertise in using Rational tools for creating use cases, version control, and defect tracking and monitoring and used the Rational Unified Process (RUP) methodology in all areas of the software development life cycle (SDLC).","experience":"HSBC, New York, NY Jan '10 - Feb '11\nBusiness Analyst\nWorked as a Business Analyst in LOS - Loan Origination System and involved in analysis, design, development, and implementation. It is based on open standards and designed to be implemented within a Service-Oriented Architecture (SOA). The system will be a front end to the lending system of the retail finance institutions and banks involved in automotive, personal, credit card, Home Loans, and line of credit application processing.","objective":":\nLead business initiatives including brainstorming on new functionality for current systems.\nGathered and documented the requirements that were critical to the business mission and used those requirements to design application software using a Use Case in Requisite Pro\nConducted JAD sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues and come to an agreement quickly.\nCreated use case scenarios and documented work flow and business process.\nDocumented business workflows textually as well as in UML diagrams for the stakeholder review\nAnalyzed and documented Business requirements and detail design of the software for full understanding of the business.\nConducted FRS and URS reviews and walkthroughs with the designers, developers and stakeholders\nUsed Requisite Pro to document requirements, associated change requests with requirements and connected requirements with Use cases.\nSupported IT unit creating functional specification documents for the design, development and implementation of strategic projects.\nWork with the Data Migration team on a Data mapping document to support the ETL process\nWorked on web services to connect services together into a service-oriented architecture (SOA )\nSupported the assigned project manager with creating detailed project plans assisting in developing, scheduling and tracking project timelines.\nSupported project governance and provided regular project communications to the project manager and business areas.\nPerformed feasibility, adaptability study and risk analysis to identify the business critical areas from USER perspective.\nMonitored overall testing progress of the QA & Technical in Quality Center\nAssisted quality assurance team in testing different releases and performed User Acceptance Testing (UAT)\n=\nU.S. Bank, MN Sep '08 – Dec '09\nBusiness Analyst\nU.S. Bank is a leading financial group which offers traditional banking, investment management, insurance, mortgage, brokerage, etc. The project involved working on a web business portal which aids in servicing company's customers with their accounts, viewing portfolios, mutual funds and other investment prospects for individuals and organizations. The capacity of the project was to create an integrated solution to replace the existing isolated systems.:\nActed as a liaison between the business, data and the technical teams throughout the project lifecycle.\nExtracted the business requirements from various sessions with business leads and maintained them using Requisite Pro, tracing them all the way to the system artifacts.\nCreated activity diagrams, use case diagrams, sequence diagrams, collaboration diagrams and data flow diagrams in UML using Rose and MS Visio.\nExcelled in mobilizing the team within the SOA architecture for various requirements from the business users\nInvolved in identifying Functional and Non-Functional requirements.\nInvolved in GAP analysis in the identification of business rules, business and system process flows, requirements and assumptions.\nPartnered with the technical team in research and resolution of system development issues and process problems.\nConducted User Acceptance Testing (UAT) and verified performance, reliability and fault tolerance issues.\nCommended ability to multi-task on projects consisting of diverse set of people, platforms and parallel timelines via exceptional communicational, organizational and interpersonal skills.\nWorked closely with Siebel (CRM) systems to provide technical specifications of other application and modules with Siebel CRM\nKey Bank, OH Jul'07 – Aug '08\nBusiness Analyst\nKey Bank is a financial services company dedicated in providing mortgage, consumer finance, banking, insurance and investments through its stores, internet and other delivery mediums. The project initiative was to migrate from an existing isolated system to a common Web Based application across its various domains like Key Bank Home Mortgage, Key Bank Financial and Consumer Credit Group to increase consistency, efficiency and market share. The system had to be modular, flexible, agile, easy to use and maintain, consistent and have higher value customer and client experience.:\nInvolved in Requirements Gathering from user groups and analyzed workflows and UI screen dynamics.\nCustomized the RUP framework and implemented it in the project.:\nDesigned and developed all Use Cases and UML models using RUP.\nIdentified, researched, investigated, analyzed, defined and documented business processes and Use Case Scenarios.\nPerformed Gap analysis by identifying existing technologies, documenting the enhancements to meet the end state requirements.\nDeveloped timelines for project delivery, and managed projects and resources to successful completion.\nResponsible for all project documentations.\nExtensively worked on Excel, Word, PowerPoint, SQL, MS Project."}