{"name":"JAMUNA CHANDRASEKARAN","email":"amunasid@gmail.com","mobile":"405-205-0709","skills":"Inventory\nRequirements Gathering\nConducting JAD Sessions\nUse Case and User Story Creation\nScope Development\nMultiple Cross-team Involvement\nTraining and Mentoring\nPreparing Training Materials\nTools/Methods:\nAgile Methodology\nRUP Methodology\nSQL\nMicrosoft Word, Excel, Access, & Power-point\nMicrosoft Visio\nRational Rose\nRational Requisite Pro\nRational Clear Quest\nEnterprise Architect\nSharepoint\nWindows 3.11/95/98/2000/NT/XP\nIndustry Application\nInsurance.","education":"s\nMBA\nOver having 6+ years of experience as a Business Analyst and Business Systems Analyst professional in the Information Systems Industry. Extensively involved in all the phases of SDLC, requirement analysis and business specification, development, enhancement, quality assurance, testing methodologies and implementation.\nExtensive experience in Life Insurance, Financials , E-Commerce and Retail, domains Software implementation and development skills with thorough understanding of the various phases of the Software Development Life Cycle (SDLC) like Requirements Gathering, Analysis, Design, Development and Testing.\nProficient in gathering and analyzing the Business Requirements, documenting System Requirement Specifications, Functional Requirement Specifications, Requirements Traceability Matrix using Rational Requisite PRO and Software development plan.\nFacilitated of JAD (Joint Application Design) sessions and coordinating extensive communication networks (interviews, written correspondence, reports, implementation requirements, project status reports, Power point presentations, e-mails, etc.) to keep executive staff and team members apprised of goals, project status, and resolving issues and conflicts.\nExtensive Experience with process modeling using UML, Flow charts, sequence diagrams, state diagrams, activity diagrams and use case diagrams. Well versed in project management tools like MS-Project for status reporting and planning.\nUsed Provision for Business Modeling diagrams and for Business objects interaction for complete understanding of the system.\nExpertise in various types of testing including unit, integration, functional, system and performance testing.\nKnowledge in Data Analysis, Data Mapping, Data Modeling, Entity Relationship Diagram, Normalization and Strong understanding of Legacy DBMS, Relational DBMS, Object-Oriented DBMS, and Multidimensional DBMS.\nCreated Test Plans, Test Cases, Test Scenarios and Test Strategies to ensure Quality Assurance and to test all the business requirements.","experience":"The Schwan Food Company Marshall, MN Nov, 2010 – Present\nBusiness Systems Analyst for Schwans.com and Payment Gateway\nThe Schwan Food Company is a multibillion-dollar, privately owned company with 17,000 employees in the United States. Based in Marshall, Minnesota, the company sells frozen foods from home-delivery trucks, in grocery-store freezers, by mail and to the food service industry. The company produces, markets, and distributes products developed under brands such as Schwan's, Red Baron, Freschetta, Tony's, Mrs. Smith's, Edwards, Pagoda Express and many others. The company's major business units include Schwan's Home Service, Schwan's Consumer Brands, Schwan's Food Service, and Schwan's Global Supply Chain.\nSchwan's Home Service, the company's flagship business unit, is the largest direct-to-home food delivery provider in the United States. Home Service markets and distributes more than 400 products under the Schwan's and LiveSmart brands. The business has nearly 500 sales-and-distribution centers located throughout the United States with 5,700 propane and diesel-powered delivery vehicles.\nPROJECT SCOPE: Worked with numerous projects and releases within Schwan's Home Service (Information Services). The projects, which I have worked include with Schwans.com team E-Commerce marketing, and also with Payment Gateway project, which compromised various analysis pertaining to ACH transactions processing (such as Schwan Card Program and Gift Cards), data transfer, data analysis, and building new batch applications for data transfer and also worked with data conversion process and requirement for vendor transition. My roles and responsibilities within Schwan's are detailed out below.\nROLES AND RESPONSIBILITIES:\nConducted current state analysis and proposed state analysis. Collected and documented business processes as well as business rules.\nParticipated in the identification, understanding, and documentation of business requirements, including the applications capable of supporting those requirements.\nDocumented the business as well as technical requirements using Optimal Trace - is a comprehensive collaborative environment for capturing, viewing and managing structured requirements.\nPrepared various artifacts such as use cases, workflow diagrams, business process models, functional requirement specifications (FRS) and System requirements specifications (SRS) by interacting with end users, development team, the subject matter experts(SME's) and other project team members.\nWrote requirements for data conversion process and design documentation for vendor transition within Schwan's.\nPerformed data analysis and developed batch applications for data transfer to take place between Schwan's and its vendors.\nUsed ProVision for business modeling diagrams and busines objects interactions.\nDesigned Business Modeling pertaining to the requirements and updated the existing Business modeling with changes.\nCreated Use Cases, Sequence Diagrams, Collaboration diagrams, Activity Diagrams, and Class diagrams using Business Process Models using MS-Visio, MS-Excel, MS-Project.\nDecomposed high-level business and user requirements into prioritized functional requirements, specified in an appropriate level of detail suitable for a development team.\nFacilitated Joint Application Development (JAD) sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues and come to an agreement quickly.\nOrganized and performed walkthrough of my requirements document with the stakeholders as well as the development team.\nWorked with the UI team to create the User Interface screenshots to be presented to the stakeholders.\nWorked on Wireframe annotations on the JPEGS and reviewed with the development team and business unit.\nAssisting the project manager in creating detailed project plans and scheduling and tracking project timelines.\nWorked as the primary liaison between the business user and the developers throughout the project cycle.\nPerformed Gap Analysis to identify the deficiencies of the current system and to identify the requirements for the change in the proposed system.\nWorked on social media, page design, and website analysis or current and future state and matching the applications supportive of the requirements.\nHandled changes at each stage of project development.\nFacilitated Conference Calls and Meetings between the vendors and users. The meetings were conducted on as needed basis to review performance.\nAnalyzed and documented information system requirements and the corresponding impact on business processes.\nPerformed Data Analysis of existing data through SQL.\nIdentify data elements from the source systems, performed data analysis to come up with data cleansing and integration rules for the ETL process.\nPerformed extensive requirement analysis including data analysis and gap analysis.\nAssisted the testing team in developing the test plan, test conditions, and test cases based on business requirements and technical specifications.\nInvolved in Data Analysis and Mapping to tracking, managing, tracing all requirements by producing a traceability.\nUnderstood the business logic, User Requirements and test-objectives to develop Test plans, Test cases, Use Case Scenarios, Test case execution using Test Director.\nInvolved in walkthroughs and meetings with development team to discuss related issues.\nFacilitated User Acceptance Testing (UAT) with the stakeholders and the business users, and the errors discovered were fixed and then verified via regression testing.\nEnvironment: Rational Rose, SQL, Webportal V7, MS Office, MS-Project, MS Visio, Optimal Trace, MS Share Point, Websphere Webportal V7, Crystal Reports, Test Director.\nCLIENT: HIGHMARK LIFE INSURANCE, PITTSBURGH, PA SEP 2009 – JUNE 2010\nROLE: Business Analyst\nProject Overview: This project at Highmark Life Insurance involved me helping to develop a Comprehensive Information Management System (CIMS) about workers injuries. The purpose of this project is to support all the forms processed against workers compensation claim. This system was developed using client server technology, Sybase11 and PowerBuilder 5 integrated with Visual Info for Claims and Adjudication Forms Management. I also had to work with SMEs on helping to develop this system. This involved a high level of interaction, which involved having effective communication skills (verbal and written), excellent interpersonal skills, as well as exceptional organization skills. I had to have excellent knowledge of the adjudication and claims process so that I could help make these changes and to help develop this system.\nROLES AND RESPONSIBILITIES:\nFacilitated and managed meetings sessions with committees of SMEs to define business requirements for 2 main components of the CIMS system: Claims and Adjudication Forms Management and also Scheduling component.\nDeveloped an initial use-case model for the Claims and Adjudication Forms Management cornerstone CIMS functionality.\nContributed to designing a prototype of future system claim processing based on data from an Agreement for Compensation for Disability or permanent Injury Form.\nResponsible for identifying and documenting business rules applied processing most of forms by the Claims and Adjudication Form Management component. Followed UML processes and standard operating procedures in developing use cases, use case diagrams, and other supporting documentation.\nActed as a resource in understanding how system implement business functions IS and ensured timely and effective completion. Delivered Functional Design Specification Document for the Scheduling component\nParticipated in the logical and physical design sessions, produced design documents.\nConducted benchmarking activities to identify best practices. Conducted Use Acceptance Testing.\nDemonstrated good management of time and effective use of resources in order to meet stringent deadlines.\nAddressed all aspects of the claim processing lifecycle, starting from identifying a claim right up to closure.\nResearched the various steps in the lifecycle and then constructed the system in such a way that the riskier claims could be easily identified and monitored.\nDocumentation of business modeling logic and diagrams pertaining to the scope and requirements of the project.\nDeveloped project plans and managed scope using SDLC methodology.\nPerformed impact analysis, went through all the use cases and workflows.\nAlso conducted gap analysis to derive requirements for the automation process.\nWorked extensively with SMEs in understanding and documenting their requirements pertaining to the issue.\nAssisted the project manager in preparing the project schedules, milestone tracking, and resource allocation using Microsoft project 2000. Created functional specification document.\nInvolved in manual testing and UAT with the development team and QA team.\nEnvironment: MS Word, MS VISIO, MS Project 2000, MS Access, MS Power Point, MS Excel, Rational Requisite Pro, Rational Clear Case.\nClient: PRUDENTIAL FINANCIAL, ISELIN, NJ JUN 2008 – MAY 2009\nBusiness Analyst (property and casualty)\nPrudential Financial Inc. is a financial service leader deals in investment, real estate, commercial property and insurance. The project is for the property and casualty division of prudential. The application involved enhancing the online life insurance quoting system, claim processing. It provides a wide range of options relating to choice of policy.\nROLES AND RESPONSIBILITIES:\nInteracted with Subject Matter Experts such as Prudential's Investment Managers, Loan originating Managers, and Process Analysts to gather requirements and goals through interviews, surveys to understand the business process. Conducted a controlled brain-storming sessions with project focus groups.\nInvolved in gathering and synthesizing business requirements and translated into functional and non-functional requirements to be used as input to the functional design specifications.\nDesigned Use cases, Use case diagrams to present a better view of the system as a whole to the technical team for them to identify the key processes.\nInteracted with technical Architects to identify and analyze the given information, procedures and decision flows and evaluated existing procedures.\nActed as liaison between the SME's and the technical teams, handled all scheduling, resource planning and allocation matters, ran all status meetings and compiled reports.\nExtensively worked on Creating User requirement Specifications (URS), Functional Requirement Specifications (FRS), and Business Process Documents and also developed System Requirements.\nPrepared Use Cases, Use Case Scenarios and elaborated those using UML diagrams like Use Case Diagrams, Activity Diagrams, Data Flow Diagrams, Business Process and Data Process Model using MS Visio.\nFacilitated Joint Application Development (JAD) sessions for communicating and managing expectations with SME's and to understand thoroughly the business process and the interface requirements, which need to be incorporated in the application.\nPerformed lot of Customizations, Enhancements, Updates and changing functionalities of web page.\nCreated and executed various the Test Cases.\nWorked as a team with Developers and Process Analysts in preparing the requirements, writing workflows, process flows, and Interacted with system developers to resolve questions and discrepancies in BRD.\nEnvironment: Windows 2000, SQL, PL/SQL, MS-Project, MS-Office Suite, MS Visio, HP Quality Center, Mercury Test Director.\nClient: HARTFORD INSURANCE, HARTFORD, CT Oct 2007 – Mar 2008\nBusiness Analyst\nProject Overview:\nThe Hartford Insurance is one of the largest investment and insurance companies in the United States. The Hartford is a leading provider of investment products, life insurance and group and employee benefits; automobile and homeowners products; and business insurance. The company is the largest seller of individual annuities in the U.S. and has been a provider of auto and homeowners insurance to members of AARP. The project involved developing comprehensive online requests for auto insurance quote processing.\nROLES AND RESPONSIBILITIES:\nPrepared use case models based on Business Requirement documentation gathered through interaction with users.\nWorked throughout the SDLC, which included requirements, specifications, design, analysis and testing utilizing RUP methodology.\nPerformed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.\nInvolved in creating and enhancing requirements, analysis and design using Rational Tools (Rational Rose, Rational Requisite Pro, Rational Clear Case, and Clear Quest).\nCreating user requirements document for companywide reports by interacting with end users and developers.\nInteract with the developers and defined the needs to update the design of the Graphical User Interface.\nConducted business reviews, walkthrough sessions and facilitated monthly and weekly meetings/reviews.\nParticipated in various meetings and discussed Enhancement and Modification Request issues.","objective":":\nConducted current state analysis and proposed state analysis. Collected and documented business processes as well as business rules.\nParticipated in the identification, understanding, and documentation of business requirements, including the applications capable of supporting those requirements.\nDocumented the business as well as technical requirements using Optimal Trace - is a comprehensive collaborative environment for capturing, viewing and managing structured requirements.\nPrepared various artifacts such as use cases, workflow diagrams, business process models, functional requirement specifications (FRS) and System requirements specifications (SRS) by interacting with end users, development team, the subject matter experts(SME's) and other project team members.\nWrote requirements for data conversion process and design documentation for vendor transition within Schwan's.\nPerformed data analysis and developed batch applications for data transfer to take place between Schwan's and its vendors.\nUsed ProVision for business modeling diagrams and busines objects interactions.\nDesigned Business Modeling pertaining to the requirements and updated the existing Business modeling with changes.\nCreated Use Cases, Sequence Diagrams, Collaboration diagrams, Activity Diagrams, and Class diagrams using Business Process Models using MS-Visio, MS-Excel, MS-Project.\nDecomposed high-level business and user requirements into prioritized functional requirements, specified in an appropriate level of detail suitable for a development team.\nFacilitated Joint Application Development (JAD) sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues and come to an agreement quickly.\nOrganized and performed walkthrough of my requirements document with the stakeholders as well as the development team.\nWorked with the UI team to create the User Interface screenshots to be presented to the stakeholders.\nWorked on Wireframe annotations on the JPEGS and reviewed with the development team and business unit.\nAssisting the project manager in creating detailed project plans and scheduling and tracking project timelines.\nWorked as the primary liaison between the business user and the developers throughout the project cycle.\nPerformed Gap Analysis to identify the deficiencies of the current system and to identify the requirements for the change in the proposed system.\nWorked on social media, page design, and website analysis or current and future state and matching the applications supportive of the requirements.\nHandled changes at each stage of project development.\nFacilitated Conference Calls and Meetings between the vendors and users. The meetings were conducted on as needed basis to review performance.\nAnalyzed and documented information system requirements and the corresponding impact on business processes.\nPerformed Data Analysis of existing data through SQL.\nIdentify data elements from the source systems, performed data analysis to come up with data cleansing and integration rules for the ETL process.\nPerformed extensive requirement analysis including data analysis and gap analysis.\nAssisted the testing team in developing the test plan, test conditions, and test cases based on business requirements and technical specifications.\nInvolved in Data Analysis and Mapping to tracking, managing, tracing all requirements by producing a traceability.\nUnderstood the business logic, User Requirements and test-objectives to develop Test plans, Test cases, Use Case Scenarios, Test case execution using Test Director.\nInvolved in walkthroughs and meetings with development team to discuss related issues.\nFacilitated User Acceptance Testing (UAT) with the stakeholders and the business users, and the errors discovered were fixed and then verified via regression testing.\nEnvironment: Rational Rose, SQL, Webportal V7, MS Office, MS-Project, MS Visio, Optimal Trace, MS Share Point, Websphere Webportal V7, Crystal Reports, Test Director.\nCLIENT: HIGHMARK LIFE INSURANCE, PITTSBURGH, PA SEP 2009 – JUNE 2010\nROLE: Business Analyst\nProject Overview: This project at Highmark Life Insurance involved me helping to develop a Comprehensive Information Management System (CIMS) about workers injuries. The purpose of this project is to support all the forms processed against workers compensation claim. This system was developed using client server technology, Sybase11 and PowerBuilder 5 integrated with Visual Info for Claims and Adjudication Forms Management. I also had to work with SMEs on helping to develop this system. This involved a high level of interaction, which involved having effective communication skills (verbal and written), excellent interpersonal skills, as well as exceptional organization skills. I had to have excellent knowledge of the adjudication and claims process so that I could help make these changes and to help develop this system.\nROLES AND RESPONSIBILITIES:\nFacilitated and managed meetings sessions with committees of SMEs to define business requirements for 2 main components of the CIMS system: Claims and Adjudication Forms Management and also Scheduling component.\nDeveloped an initial use-case model for the Claims and Adjudication Forms Management cornerstone CIMS functionality.\nContributed to designing a prototype of future system claim processing based on data from an Agreement for Compensation for Disability or permanent Injury Form.\nResponsible for identifying and documenting business rules applied processing most of forms by the Claims and Adjudication Form Management component. Followed UML processes and standard operating procedures in developing use cases, use case diagrams, and other supporting documentation.\nActed as a resource in understanding how system implement business functions IS and ensured timely and effective completion. Delivered Functional Design Specification Document for the Scheduling component\nParticipated in the logical and physical design sessions, produced design documents.\nConducted benchmarking activities to identify best practices. Conducted Use Acceptance Testing.\nDemonstrated good management of time and effective use of resources in order to meet stringent deadlines.\nAddressed all aspects of the claim processing lifecycle, starting from identifying a claim right up to closure.\nResearched the various steps in the lifecycle and then constructed the system in such a way that the riskier claims could be easily identified and monitored.\nDocumentation of business modeling logic and diagrams pertaining to the scope and requirements of the project.\nDeveloped project plans and managed scope using SDLC methodology.\nPerformed impact analysis, went through all the use cases and workflows.\nAlso conducted gap analysis to derive requirements for the automation process.\nWorked extensively with SMEs in understanding and documenting their requirements pertaining to the issue.\nAssisted the project manager in preparing the project schedules, milestone tracking, and resource allocation using Microsoft project 2000. Created functional specification document.\nInvolved in manual testing and UAT with the development team and QA team.\nEnvironment: MS Word, MS VISIO, MS Project 2000, MS Access, MS Power Point, MS Excel, Rational Requisite Pro, Rational Clear Case.\nClient: PRUDENTIAL FINANCIAL, ISELIN, NJ JUN 2008 – MAY 2009\nBusiness Analyst (property and casualty)\nPrudential Financial Inc. is a financial service leader deals in investment, real estate, commercial property and insurance. The project is for the property and casualty division of prudential. The application involved enhancing the online life insurance quoting system, claim processing. It provides a wide range of options relating to choice of policy.\nROLES AND RESPONSIBILITIES:\nInteracted with Subject Matter Experts such as Prudential's Investment Managers, Loan originating Managers, and Process Analysts to gather requirements and goals through interviews, surveys to understand the business process. Conducted a controlled brain-storming sessions with project focus groups.\nInvolved in gathering and synthesizing business requirements and translated into functional and non-functional requirements to be used as input to the functional design specifications.\nDesigned Use cases, Use case diagrams to present a better view of the system as a whole to the technical team for them to identify the key processes.\nInteracted with technical Architects to identify and analyze the given information, procedures and decision flows and evaluated existing procedures.\nActed as liaison between the SME's and the technical teams, handled all scheduling, resource planning and allocation matters, ran all status meetings and compiled reports.\nExtensively worked on Creating User requirement Specifications (URS), Functional Requirement Specifications (FRS), and Business Process Documents and also developed System Requirements.\nPrepared Use Cases, Use Case Scenarios and elaborated those using UML diagrams like Use Case Diagrams, Activity Diagrams, Data Flow Diagrams, Business Process and Data Process Model using MS Visio.\nFacilitated Joint Application Development (JAD) sessions for communicating and managing expectations with SME's and to understand thoroughly the business process and the interface requirements, which need to be incorporated in the application.\nPerformed lot of Customizations, Enhancements, Updates and changing functionalities of web page.\nCreated and executed various the Test Cases.\nWorked as a team with Developers and Process Analysts in preparing the requirements, writing workflows, process flows, and Interacted with system developers to resolve questions and discrepancies in BRD.\nEnvironment: Windows 2000, SQL, PL/SQL, MS-Project, MS-Office Suite, MS Visio, HP Quality Center, Mercury Test Director.\nClient: HARTFORD INSURANCE, HARTFORD, CT Oct 2007 – Mar 2008\nBusiness Analyst\nProject Overview:\nThe Hartford Insurance is one of the largest investment and insurance companies in the United States. The Hartford is a leading provider of investment products, life insurance and group and employee benefits; automobile and homeowners products; and business insurance. The company is the largest seller of individual annuities in the U.S. and has been a provider of auto and homeowners insurance to members of AARP. The project involved developing comprehensive online requests for auto insurance quote processing.\nROLES AND RESPONSIBILITIES:\nPrepared use case models based on Business Requirement documentation gathered through interaction with users.\nWorked throughout the SDLC, which included requirements, specifications, design, analysis and testing utilizing RUP methodology.\nPerformed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.\nInvolved in creating and enhancing requirements, analysis and design using Rational Tools (Rational Rose, Rational Requisite Pro, Rational Clear Case, and Clear Quest).\nCreating user requirements document for companywide reports by interacting with end users and developers.\nInteract with the developers and defined the needs to update the design of the Graphical User Interface.\nConducted business reviews, walkthrough sessions and facilitated monthly and weekly meetings/reviews.\nParticipated in various meetings and discussed Enhancement and Modification Request issues.:\nFacilitated and managed meetings sessions with committees of SMEs to define business requirements for 2 main components of the CIMS system: Claims and Adjudication Forms Management and also Scheduling component.\nDeveloped an initial use-case model for the Claims and Adjudication Forms Management cornerstone CIMS functionality.\nContributed to designing a prototype of future system claim processing based on data from an Agreement for Compensation for Disability or permanent Injury Form.\nResponsible for identifying and documenting business rules applied processing most of forms by the Claims and Adjudication Form Management component. Followed UML processes and standard operating procedures in developing use cases, use case diagrams, and other supporting documentation.\nActed as a resource in understanding how system implement business functions IS and ensured timely and effective completion. Delivered Functional Design Specification Document for the Scheduling component\nParticipated in the logical and physical design sessions, produced design documents.\nConducted benchmarking activities to identify best practices. Conducted Use Acceptance Testing.\nDemonstrated good management of time and effective use of resources in order to meet stringent deadlines.\nAddressed all aspects of the claim processing lifecycle, starting from identifying a claim right up to closure.\nResearched the various steps in the lifecycle and then constructed the system in such a way that the riskier claims could be easily identified and monitored.\nDocumentation of business modeling logic and diagrams pertaining to the scope and requirements of the project.\nDeveloped project plans and managed scope using SDLC methodology.\nPerformed impact analysis, went through all the use cases and workflows.\nAlso conducted gap analysis to derive requirements for the automation process.\nWorked extensively with SMEs in understanding and documenting their requirements pertaining to the issue.\nAssisted the project manager in preparing the project schedules, milestone tracking, and resource allocation using Microsoft project 2000. Created functional specification document.\nInvolved in manual testing and UAT with the development team and QA team.\nEnvironment: MS Word, MS VISIO, MS Project 2000, MS Access, MS Power Point, MS Excel, Rational Requisite Pro, Rational Clear Case.\nClient: PRUDENTIAL FINANCIAL, ISELIN, NJ JUN 2008 – MAY 2009\nBusiness Analyst (property and casualty)\nPrudential Financial Inc. is a financial service leader deals in investment, real estate, commercial property and insurance. The project is for the property and casualty division of prudential. The application involved enhancing the online life insurance quoting system, claim processing. It provides a wide range of options relating to choice of policy.\nROLES AND RESPONSIBILITIES:\nInteracted with Subject Matter Experts such as Prudential's Investment Managers, Loan originating Managers, and Process Analysts to gather requirements and goals through interviews, surveys to understand the business process. Conducted a controlled brain-storming sessions with project focus groups.\nInvolved in gathering and synthesizing business requirements and translated into functional and non-functional requirements to be used as input to the functional design specifications.\nDesigned Use cases, Use case diagrams to present a better view of the system as a whole to the technical team for them to identify the key processes.\nInteracted with technical Architects to identify and analyze the given information, procedures and decision flows and evaluated existing procedures.\nActed as liaison between the SME's and the technical teams, handled all scheduling, resource planning and allocation matters, ran all status meetings and compiled reports.\nExtensively worked on Creating User requirement Specifications (URS), Functional Requirement Specifications (FRS), and Business Process Documents and also developed System Requirements.\nPrepared Use Cases, Use Case Scenarios and elaborated those using UML diagrams like Use Case Diagrams, Activity Diagrams, Data Flow Diagrams, Business Process and Data Process Model using MS Visio.\nFacilitated Joint Application Development (JAD) sessions for communicating and managing expectations with SME's and to understand thoroughly the business process and the interface requirements, which need to be incorporated in the application.\nPerformed lot of Customizations, Enhancements, Updates and changing functionalities of web page.\nCreated and executed various the Test Cases.\nWorked as a team with Developers and Process Analysts in preparing the requirements, writing workflows, process flows, and Interacted with system developers to resolve questions and discrepancies in BRD.\nEnvironment: Windows 2000, SQL, PL/SQL, MS-Project, MS-Office Suite, MS Visio, HP Quality Center, Mercury Test Director.\nClient: HARTFORD INSURANCE, HARTFORD, CT Oct 2007 – Mar 2008\nBusiness Analyst\nProject Overview:\nThe Hartford Insurance is one of the largest investment and insurance companies in the United States. The Hartford is a leading provider of investment products, life insurance and group and employee benefits; automobile and homeowners products; and business insurance. The company is the largest seller of individual annuities in the U.S. and has been a provider of auto and homeowners insurance to members of AARP. The project involved developing comprehensive online requests for auto insurance quote processing.\nROLES AND RESPONSIBILITIES:\nPrepared use case models based on Business Requirement documentation gathered through interaction with users.\nWorked throughout the SDLC, which included requirements, specifications, design, analysis and testing utilizing RUP methodology.\nPerformed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.\nInvolved in creating and enhancing requirements, analysis and design using Rational Tools (Rational Rose, Rational Requisite Pro, Rational Clear Case, and Clear Quest).\nCreating user requirements document for companywide reports by interacting with end users and developers.\nInteract with the developers and defined the needs to update the design of the Graphical User Interface.\nConducted business reviews, walkthrough sessions and facilitated monthly and weekly meetings/reviews.\nParticipated in various meetings and discussed Enhancement and Modification Request issues.:\nInteracted with Subject Matter Experts such as Prudential's Investment Managers, Loan originating Managers, and Process Analysts to gather requirements and goals through interviews, surveys to understand the business process. Conducted a controlled brain-storming sessions with project focus groups.\nInvolved in gathering and synthesizing business requirements and translated into functional and non-functional requirements to be used as input to the functional design specifications.\nDesigned Use cases, Use case diagrams to present a better view of the system as a whole to the technical team for them to identify the key processes.\nInteracted with technical Architects to identify and analyze the given information, procedures and decision flows and evaluated existing procedures.\nActed as liaison between the SME's and the technical teams, handled all scheduling, resource planning and allocation matters, ran all status meetings and compiled reports.\nExtensively worked on Creating User requirement Specifications (URS), Functional Requirement Specifications (FRS), and Business Process Documents and also developed System Requirements.\nPrepared Use Cases, Use Case Scenarios and elaborated those using UML diagrams like Use Case Diagrams, Activity Diagrams, Data Flow Diagrams, Business Process and Data Process Model using MS Visio.\nFacilitated Joint Application Development (JAD) sessions for communicating and managing expectations with SME's and to understand thoroughly the business process and the interface requirements, which need to be incorporated in the application.\nPerformed lot of Customizations, Enhancements, Updates and changing functionalities of web page.\nCreated and executed various the Test Cases.\nWorked as a team with Developers and Process Analysts in preparing the requirements, writing workflows, process flows, and Interacted with system developers to resolve questions and discrepancies in BRD.\nEnvironment: Windows 2000, SQL, PL/SQL, MS-Project, MS-Office Suite, MS Visio, HP Quality Center, Mercury Test Director.\nClient: HARTFORD INSURANCE, HARTFORD, CT Oct 2007 – Mar 2008\nBusiness Analyst\nProject Overview:\nThe Hartford Insurance is one of the largest investment and insurance companies in the United States. The Hartford is a leading provider of investment products, life insurance and group and employee benefits; automobile and homeowners products; and business insurance. The company is the largest seller of individual annuities in the U.S. and has been a provider of auto and homeowners insurance to members of AARP. The project involved developing comprehensive online requests for auto insurance quote processing.\nROLES AND RESPONSIBILITIES:\nPrepared use case models based on Business Requirement documentation gathered through interaction with users.\nWorked throughout the SDLC, which included requirements, specifications, design, analysis and testing utilizing RUP methodology.\nPerformed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.\nInvolved in creating and enhancing requirements, analysis and design using Rational Tools (Rational Rose, Rational Requisite Pro, Rational Clear Case, and Clear Quest).\nCreating user requirements document for companywide reports by interacting with end users and developers.\nInteract with the developers and defined the needs to update the design of the Graphical User Interface.\nConducted business reviews, walkthrough sessions and facilitated monthly and weekly meetings/reviews.\nParticipated in various meetings and discussed Enhancement and Modification Request issues.:\nPrepared use case models based on Business Requirement documentation gathered through interaction with users.\nWorked throughout the SDLC, which included requirements, specifications, design, analysis and testing utilizing RUP methodology.\nPerformed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.\nInvolved in creating and enhancing requirements, analysis and design using Rational Tools (Rational Rose, Rational Requisite Pro, Rational Clear Case, and Clear Quest).\nCreating user requirements document for companywide reports by interacting with end users and developers.\nInteract with the developers and defined the needs to update the design of the Graphical User Interface.\nConducted business reviews, walkthrough sessions and facilitated monthly and weekly meetings/reviews.\nParticipated in various meetings and discussed Enhancement and Modification Request issues.:\nPlayed the role of a Use Case Analyst in a RUP environment by eliciting Business Requirements from business users by conducting various meetings.\nConducted various interviews and meetings for requirement gathering with key business users and SMEs at in-house location.\nMaintained and kept track of stakeholders request for system enhancements and changes.\nUsed Rational Requisite Pro to analyze and document requirements.\nUsed Test Director for essential aspects of test management -Test Plan and Defects Management.\nWorked with development and testing teams to accomplish timely release objectives.\nAnalyzed the system functionality in relation to impacts of the change requests and other system modifications.\nDocumented the change requests and provided the reasons and root cause of change.\nCreated and Modified the Use Cases for the incoming change requests and system enhancements.\nDeveloped the test conditions and test cases to be used in testing the system based on business requirements, technical specifications and/or product knowledge.\nControlled and tracked defects and change requests using Test Director.\nUsed Test Director to create reports and graphs to help review the progress of planning tests, running tests, and tracking defects.\nDesigned screen mockups for changes in system functionality using MS Visio and MS Paint etc.\nProvided ROM for various projects and system enhancements.\nReviewed test objectives to make sure that all the possible scenarios are tested for the system enhancements.\nDocumented Meeting Minutes of various meetings and Brainstorming Sessions.\nPrepared test plan to accomplish timely release objectives.\nDeveloped project delivery schedule, managed projects and identified resources to successful completion.\nEnvironment: MS Word, MS VISIO, MS Project 2000, MS Access, MS Power Point, MS Excel, Rational Requisite Pro, Rational Clear Case.","summary":":\nThe Hartford Insurance is one of the largest investment and insurance companies in the United States. The Hartford is a leading provider of investment products, life insurance and group and employee benefits; automobile and homeowners products; and business insurance. The company is the largest seller of individual annuities in the U.S. and has been a provider of auto and homeowners insurance to members of AARP. The project involved developing comprehensive online requests for auto insurance quote processing.\nROLES AND RESPONSIBILITIES:\nPrepared use case models based on Business Requirement documentation gathered through interaction with users.\nWorked throughout the SDLC, which included requirements, specifications, design, analysis and testing utilizing RUP methodology.\nPerformed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.\nInvolved in creating and enhancing requirements, analysis and design using Rational Tools (Rational Rose, Rational Requisite Pro, Rational Clear Case, and Clear Quest).\nCreating user requirements document for companywide reports by interacting with end users and developers.\nInteract with the developers and defined the needs to update the design of the Graphical User Interface.\nConducted business reviews, walkthrough sessions and facilitated monthly and weekly meetings/reviews.\nParticipated in various meetings and discussed Enhancement and Modification Request issues."}