{"name":"Renee Grossheim","email":"reneegrossheim@aol.com","summary":"of Qualifications:\nAbility to work on multiple projects and jobs while maintaining a focus on the task at hand\nInternational Association of Information Technology Asset Manager certifications as Hardware Asset Manager and Software Asset Manager\nAdept at quickly analyzing situations and facts, and responding with creative solutions.\nWork well autonomously, with minimal supervision, and/or as part of a team.","education":"s:\nAbility to work on multiple projects and jobs while maintaining a focus on the task at hand\nInternational Association of Information Technology Asset Manager certifications as Hardware Asset Manager and Software Asset Manager\nAdept at quickly analyzing situations and facts, and responding with creative solutions.\nWork well autonomously, with minimal supervision, and/or as part of a team.:\nB2T Training Katy, Texas\nDetailing Process and Business Rule Requirements Attended: April 2011\nSuccessfully completed training and testing\nB2T Training Katy, Texas\nDetailing Business Data Requirements Attended: February 2011\nSuccessfully completed training and testing\nB2T Training Katy, Texas\nEssential Skills for Business Analysis Attended: November 2009\nSuccessfully completed training and testing\nInternational Association of IT Asset Managers Austin, Texas\nCHAMP and CSAM Attended: December 2007\nSuccessfully completed training and Certification Testing\nTravis County Sheriff's Academy Austin, Texas\nLaw Enforcement Certification Attended: July 1991 to September 1991\nTarleton State University Stephenville, Texas\n32 Semester Hours Attended: September 1987 to May 1988","experience":":\nAcademy Sports + Outdoors Katy, Texas\nNovember 2008 to Present\nIT Business Analyst / Budget Controller November 2008 to Present\n/ IT Purchasing Assistant\nProcess Month End Time Keeping of full time associated prior to submission to Accounting\nAssist other departments with functional PeopleSoft questions in relation to Capital Expenditures\nCreate Reports and Documents to assist VP/CIO and IT Directors with establishing overall IT Budget\nPrepare and facilitate meetings with VP/CIO and IT Directors in Annual Budget Process\nRun reports on weekly and monthly basis to assist VP/CIO and directors in maintaining overall IT Budget\nMaintain visibility of a $13MM Operating Budget; $27MM Support Expense Budget and $19 MM Capital Budget (Total $59MM Budget)\nCreate Requisitions and Purchase Order for the PMO Group as PMO Buyer\nReceive goods and services for the PMO Group\nReconcile Invoices to Purchase Orders and submit to Accounts Payable Department\nWork with IT Purchasing Group to establish best practices and answer purchasing related questions\nWork with Accounting Fixed Asset Group to properly code Purchase Orders\nWork with Accounting Fixed Asset Group to properly dispose of IT Fixed Assets\nRun reports in the Financial book of record (PeopleSoft) for Project Managers (ad hoc reporting)\nCreate Month End Closing reports for Accounting to accurately track Purchases\nCreate Month End Closing report for Accounting to accurately track Contract Labor and Consulting fees\nConduct requirements gathering meeting with Business Unit and Subject Matter Experts (SME)\nDevelop Business Requirements and related Business Rules for various Accounting related IT Projects\nWork within the guidelines of the approved SDLC process\nWorked as Project Manager on various micro-projects\nRHI (Robert Half International) Houston, Texas\nFebruary 2008 to November 2008\nAcademy Ltd. February 2008 to November 2008\nIT Purchasing Assistant\nCreate Request For Quotes for vendors\nEstablish new reports for on vendor performance (i.e., Vendor Score Card)\nBring new Hardware and Software into the lifecycle management\nMaintain database of prices for often purchased items\nMaintain database of maintenance renewals. Update database as required (monthly, annually, etc.)\nWork with IT Desktop Support to identify items that are EOL and locate viable alternatives\nCreate Purchase Orders in Company developed Purchasing Database\nReconcile Invoices to Purchase Orders and submit to Accounts Payable Department\nWork with managers and developers/programmers on new Purchasing System to integrate with Accounting and Fixed Assets\nWork with Vendors to establish Non-Disclosure Agreements\nSet-up new vendors within Vendor Database and with Accounts Payable Department\nHines Nurseries, Inc. Katy, Texas\nDecember 2004 to February 2008\nVendor and Asset Management October 2005 to February 2008\nDeveloped Policies for IT Asset Management Department\nDocumented Current processes within the IT Asset Management Department to facilitate best practices; including transferring information into digital formats\nReview contracts prior to submission to Purchasing Department for signature\nManage the location of 900 computer assets and 800 cellular assets\nRecover assets (computers, cellular phones, etc.) as required when employees leave employment of the company\nAssist managers in resolving budget questions and conflict and downloading information from Oracle system (through reports module and Discoverer)\nCreate Purchase Requisitions and Purchase Orders in Oracle system; including reoccurring Purchase Orders\nWork with Vendors to establish best practices and lowest pricing for procurement of required IT assets\nEvaluate and maintain list of approved IT vendors and submit paperwork to have new vendors established\nMaintain and order Software on new and existing agreements\nMaintain contract activity with vendors\nAppropriately apply General Ledger coding to invoices and distribute to managers for approval\nProperly receive packing slips for entry into Oracle Accounts Payable system\nMaintain and reconcile company credit card on a monthly basis for all IT purchases not produced in Oracle Purchasing System\nResearch status of payments to vendors for overdue invoices\nManage cellular phones and track cellular costs on a monthly basis, leveraging lower prices\nAssist Project Manager with special projects as required in the capacity of purchasing, vendor and asset management\nParticipate in meetings to help distribute workload and cross train with other team members to improve quality of work produced\nProduce monthly IT Operations Review Presentation\nCreate documentation and procedures for emerging Asset Management Department\nCompose correspondence as required (e-mails and letters to vendors as well as managers)\nNational Accounts Office Administrator December 2004 to October 2005\n/ Contracts Administrator\nReceive, verify code and match invoices and packing slips for entry into Oracle as well as prepare and submit journal entries for Company store, distribute coded invoices to managers for signature\nAssist employees with Human Resources issues, inquires and policy interpretations as well as conduct new employee orientations for full time and contract employees.\nWork in conjunction with managers to resolve employee issues and establish new written policies, forms and procedures\nGeneral Office Duties including but not limited to server back-ups, expense reports, travel arrangements, phone systems and maintenance of office supplies\nParticipate in meetings to help distribute workload and cross train with other team members to improve quality of work produced\nWork with property management team as liaison to ensure issues and requests are resolved in a timely manner\nAssist managers with special projects as required\nEstablish procedures for establishment of folders for new contractual agreements\nEstablish verbiage for new contractual agreements\nParticipate and run meetings (when required) to discuss contracts\nMaintain contract activity logs and distribution lists\nWork with Managers to ensure contracts are signed and returned\nScan and distribute copies of agreements as required (either in hard or soft format)\nGE PII Pipeline Solutions Houston, Texas\nOctober 2001 to December 2004\nOTR (Order to Remittance) Support / Global Scheduler July 2003 to December 2004\nWork with Project and Product Managers to ensure accuracy of Global Schedule and that Deliverables for projects were being met.\nCommunicated with team members that were sited globally\nMaintain time sheet database (using Oracle Timesheets) to track if employees were being effective utilized based on their skill sets\nAttended \"cash calls\" and participated in establishing sales forecast numbers.\nProcessed invoices from vendors to ensure that appropriate departments and jobs were charged as well as timely processing and payment of invoices.\nMaintained department Purchase Requisitions and Purchase Orders (following company policy and Sourcing guidelines).\nMaintained cell phones for Houston offices of North America (including reconciliation of bills and distribution of new phones). Established database of usage to accurately track how phones were being utilized to maintain cost effectiveness of cell phones.\nSupervised temporary contract workers, made sure work loads were evenly distributed.\nPrepared and tracked travel visa requirements and requests.\nMaintained multiple credit cards for department and company use and reconciled those each month with appropriate department charge codes.\nEstablish Global Resources Metrics and Resource Loading Metrics\nWorked with Sales and Sales Support to insure that compliance with procedures is maintained. Participate in handover meetings\nMaintained various intranet web pages for Financial reporting\nDevelop and conduct employee training workshops and seminars as required.\nAssist employees with Human Resources issues, inquires and policy interpretations.\nPlan and organize procedures and prioritize workflow to ensure efficient operation of the office. Organize files and records, transcribe letters, and draft and proof correspondence and documents\nEstablish and organize department database of staff vacation, sick leave and time reports.\nDevelop procedures and policies for office activities, including filing, records maintenance and retention, typing word processing, faxing and mail distribution.\nOffice Manager / Executive Assistant October 2001 to July 2003\nOrder office supplies and office machines.\nProvide executive assistant support to the Global Integrity Services Manager; the Global Business Manager; the Global Processes Manager; the Regional Integrity Manager, Americas; as well as various Senior Integrity Managers.\nSupervise temporary administrative employees.\nSupport client projects, including attending meetings/conference call and maintain detailed notes.\nMaintain list of client names, addresses and telephone numbers\nAssist in the development and assembling of templates for use with proposals.\nMaintain the day-to-day operations of the Global Integrity Services Department\nOrganize and coordinate production of final document preparation along with distribution and delivery to clients.\nMade travel arrangements for all employees via Internet and travel agents.\nSpoke with customers via telephone and E-mail.\nHelped in preparation of technical bid proposals.\nMODEC International Houston, Texas\nProposals Coordinator / Administrator June 2001 to October 2001\nHamilton Metals Houston, Texas\nExecutive Assistant / Systems Analysts / October 1999 to May 2001\nInside Sales Consultant","skills":"and Computer Knowledge:\nSix Sigma trained and tested (have not achieved Green Belt status, however been on multiple Six Sigma teams)\nInternational Association of Information Technology Asset Manager certifications as Hardware Asset Manager (CHAMP) and Software Asset Manager (CSAM)\nProficient knowledge of Microsoft Windows 2000, including all aspects of Microsoft Office 2000 and Office 2007 also proficient in the following programs Microsoft Visio, Microsoft Project, Paint Shop Pro and ProjecTools, e-Projects (propriety GE program)\nWorking knowledge for the following programs: Oracle 11i, Discoverer, CMS (propriety GE program), e-Sales (propriety GE program), Track-It, Everdream, Computrace, PeopleSoft Financials, PeopleSoft Purchasing module, PeopleSoft EMP, LanDesk\nWorked in other areas of business as required to achieve goals of business (including but not limited to: Project Management, HR, Sourcing, EHS, IT, Contracts/Risk, Sales, Marketing)\nWorking knowledge of-10-key by touch and data entry\nTyping speed of approximately 50 words per minute.\nWorking ability of data transcription through use of a Dictaphone.","certification":"s:\nCHAMP – Certified Hardware Asset Management Professional\nCSAM – Certified Software Asset Management\nBA Associate – Business Analyst Associate\nAffiliations:\nIAITAM – International Association of Information Technology Asset Managers:\nCHAMP – Certified Hardware Asset Management Professional\nCSAM – Certified Software Asset Management\nBA Associate – Business Analyst Associate\nAffiliations:\nIAITAM – International Association of Information Technology Asset Managers"}