{"name":"I A","email":"aarthz@gmail.com","mobile":"405-210-7682","summary":"Business Analyst with 7+ years of experience in Business analysis and design in Banking and Financial industries.\nExpertise in identifying, developing and documenting business and Functional Requirements Specifications (FRS), System Design Specification (SDS), System Requirement Specification(SRS) by organizing one on one discussions\nApplied use cases, use case diagrams, business process diagrams, business process models to effectively convey the needs and requirements of the business.\nInvolved in requirements analysis, system analysis, design and testing phases of Software Development Life Cycle (SDLC) and also in iterative, agile and structured methodologies.\nExtensively involved in user requirement gathering sessions, conducted user requirement meetings to increase efficiency.\nExpert in Use Cases, Business Process Diagrams, Sequence diagrams, Activity diagrams, Collaboration diagrams, Class diagrams development and UML modeling using modeling tools like Rational Rose and MS Visio.","experience":"Wells Fargo, NC (Feb'10 –Mar'11)\nBusiness Analyst\nWells Fargo is a diverse Financial Institution. The project mainly consisted of changing a particular process that was used in the Claims Dept. to a more secure, user friendly concept.","objective":":\nExtensively participated in gathering requirements to concretely draft BRDs.\nHelped in using these BRDs to effectively create FSDs.\nRigorously worked with the Development team to produce a help document pertaining to the FSD.\nParticipated in various meetings and given ideas relating to the upgrade of the system to come into force.\nExtensively used MS Word for drafting BRDs and FSDs.\nIndependently worked on a help document using MS Excel which was approved by the team collectively.\nHad detailed interactions with the VP, PM& SME to draft Complete BRDs pertaining to the project.\nEffectively interacted with high level officials from STL to gather certain requirements for the BRD and the Help documents.\nIncorporated MS Visio to do flowcharts diagrammatic representation, graphical representation for easy reference.\nExtensive use of power point presentation to present ideas to the team members.\nCommunicated ideas very well in unambiguous terms.\nEfficiently gathered details from the scope document and produced the information to lead.\nWorked with ETL tools for aligning necessary data and clarity.\nWorked on data modelling, mapping and migration.\nHave always been aware of the process and continuously worked to finish work well before dead lines.\nResearched and helped In the implementation of COTS.\nIdentified, researched, investigated, analyzed, defined and documented business processes and Use Case Scenarios.\nFacilitated collection of functional requirements from system users and preparation of business requirement documents using Rational Requisite Pro and developed prototypes and overall logical system design.\nFollowed a structured approach to organize requirements into logical groupings of essential Functional Requirements, Non Functional Requirements, Interface Requirements and Report Requirements and insures that critical requirements are not missed.\nActively involved in prototyping, business needs analysis and fit/gap.\nPrepared and presented weekly project reports to senior management.\nUsed Agile to segment work into sections to speed up the completion process\nPerformed Impact Analysis for reviewing the broad range of issues, including programs and copybooks, screens, reports, and files.\nProficient in Using MS Word, Excel, Powerpoint\nBank of America, Charlotte, NC (Oct'07- Dec'09)\nBusiness Systems Analyst\nBank of America is a diversified financial services company providing banking, insurance, wealth management and estate planning, investments, mortgage and consumer finance from 6,000 stores and other distribution channels across North America and elsewhere internationally. Bank of America delivers consumers and small business customers with a diversified financial service such as online banking, with Electronic bill presentment and payment for services such as mortgage loans, education finance, Credit card and other loan accounts. The online banking application also provides registered users complete access to offers features such as an online balance transfers for accounts registered with the Bank.:\nConducted detailed and comprehensive Business Analysis by working with the client IT staff, project managers, supervisors, SME's, and other stakeholders to identify the system, operational requirements and improvements.\nGathered Business Requirements and prepared business requirements documentation in Test Director.\nConverted Business Requirements documents into Functional Requirements Specification and Technical Specification.\nUsed data migration, data analysis and extraction and loading concepts for clear unambiguous flow of business needs.\nExtensive power point presentations for relaying Business Ideas.\nHelped in the business process model and design for easy and secure access to users.\nUsed MS Word extensively for scoring BRDs and FSDs.\nUsed MS Word for additional addendums for revised versions of BRDs.\nFollowed the Agile methodology in working in teams and producing desired results fast in a fast paced environment.\nWorked on Agile and waterfall models through out for best results .\nEfficiently had software installed with necessary requirements (COTS Implementation)\nConducted JAD sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues and come to an agreement quickly.\nUsed ETL to remove redundancy in data, Used SQL queries to align data for easy access and in a timely manner.\nExtensive use of MS Word, Excel, Powerpoint.\nSupported the QA team with necessary information pertaining to the process.\nUsed work flow and break down of workflow for quicker results overall in the project.\nIdentified all necessary Business Use Cases from requirements, created UML Diagrams including Use Cases Diagrams, Business Process Diagrams, Activity Diagrams, Business process models, Sequence Diagrams, Class Diagrams and web Page Mock-Ups using Microsoft Visio and Microsoft FrontPage.\nWorked on SQL queries to remove redundancy of data and effectively inform the qa team of what is required for the project.\nUnderstood the business logic, User Requirements and test-objectives to develop Test plans, Test cases, Use Case Scenarios, Test case execution using Test Director.\nUsed Microsoft Project to manage schedules, deadlines, resources and collaborate on the project.\nFIRST AMERICAN BANK, Dallas TX (Jun'05- Aug'07)\nBusiness Systems Analyst\nProject: On line Access (OLA)\nProject involved setting up web enabled access to customers to manage their mortgage accounts online. The user had to login and then he could review his payment information, view transaction history and make payment online.:\nElicited demands from the stakeholders and analyzed them for consistency, flexibility and completeness. Participated actively in assembling the JAD team and in conducting the weekly sessions from requirements gathering phase to the sign-off of the application after testing.\nEfficiently used SQL, ETL concepts for removing any redundancy in data and for smooth and fast flow of business\nOrganized workshops with Subject Matter Experts to obtain domain level information. Developed a vision plan that defined the primary goals and objectives of the project.\nIdentified actors and use cases to create use case diagrams that described the behaviour of the system. Facilitated collection of functional requirements from system users and preparation of business requirement documents using Rational Requisite Pro. Created data, functional and quality requirements.\nInvolved in version control management for storage and distribution of documentation using Rational Clear Case.\nTrained and mentored the team members in RUP and the Rational Suite.\nCreated class diagrams, use case diagrams, Business Process Diagrams and sequence diagrams to view the system from different perspectives.\nCreated the Business Architecture document to provide an overview of different aspects of the application. Documented how business goals were reflected in the requirements.\nFollowed the UML based methods using Rational Rose to create: Use Cases, Activity Diagrams/State Chart Diagrams, Sequence Diagrams, Collaboration Diagrams.\nUsed work flow process diagrams and work breakdown structure for reducing errors and time efficiency.\nUsed SQL, Toad, Data Warehousing and Data Cleansing for the arrangement of customer data.\nWrote extensive SQL queries for QA testing and report / data validation.\nWorked with management to create and communicate critical information to the user community via email and discussion boards.\nValidated technical designs created by IT developers against functional specifications. Reviewed system-testing results with the project and technical teams.\nAtlantic Financial, Boston, MA (Feb'04 - Mar'05)\nBusiness Analyst\nTo ensure timely availability of information, the client's trade management system was needed to be accessible to its customers anywhere in the world throughout the day basis to support multiple business area including Asset Management, Portfolio Management and Risk Management. To achieve this, firm decided to upgrade its technology platforms to enable its customers, i.e., brokers and institutional clients, to conduct trade activities like purchases, liquidations, exchanges and cancellations over the web. The client also wanted to enable its clients to access historical information and generate reports in a faster and more efficient manner over the Internet.:\nDesigned the business requirement collection approach based on the project scope and SDLC Methodology.\nConducted interviews with key business users to collect requirement and business process information.\nWas responsible for creating and reviewing Business requirements, Functional Requirements, project schedule, Documentation and test plans.\nDeveloped business process models in RUP to document existing and future business processes.\nCreated class diagrams, use case diagrams, Business Process Diagrams and sequence diagrams to view the system from different perspectives\nPerformed extensive requirement analysis including data analysis and gap analysis.\nDesigned and developed project document templates based on SDLC methodology.\nComprehensively work with requirement gathering for Enterprise reporting system using Requisite Pro.\nDesigned and developed all Use Cases and UML models using Rational. Developed Sequence Diagrams, OOD using UML.\nDesigned and implemented basic SQL queries for QA testing and report / data validation.\nEstablished a business Analysis methodology around the RUP (Rational Unified Process).\nHelped develop use cases, project plans and manage scope.\nDeveloped requirement reports for day-to-day retail banking needs for opening account, online banking using rational SoDA.","education":":\nMBA, Generalist\nMSc. International Marketing\nBCS, Corporate Secretaryship."}