{"name":"AP Analysis","email":"ardikptl01@gmail.com","mobile":"510-689-1261","summary":"Over 6+ years of professional experience as a Business Analyst in various domains such as Healthcare, Insurance, Banking, Investment,\nGood understanding of Software Development Life Cycle (SDLC) methodologies like Waterfall, Agile (SCRUM, RAD, and RUP).","skills":":\nRequirement Management\nRational Requisite-Pro\nBusiness/ System Modeling tools\nMicrosoft Suite, Microsoft Visio, Rational Rose, Gliffy\nOperating Systems\nMS Windows, MAC OS\nDatabases\nOracle, MS Access, MS SQL server\nBug Tracking Tool\nBugzilla, Rational Clear Quest, Quality Center\nApplications\nJD Edward, Fico\nTesting Tools\nHP Quality Center, Load Runner,\nPNC Bank, Pittsburgh, PA Feb 2009- Jun 2011","PersonalDetails":"Project Descriptions:\nThe scope of the project was to revamp the web applications which enable potential customers to perform searches for mutual fund performance, Equity, stock ratings, bond and market performance and providing information regarding recent events related to the investments. It provides a clear and complete picture of the client's asset allocation, current investment portfolio and full brokerage capability.","objective":":\nOrganized and facilitated meetings with the management and the development team, conducting requirements gathering sessions with the purpose of defining the functional business and system requirements.\nPerformed extensive requirements analysis and requirement gathering including data analysis and GAP analysis.\nConducted user interviews, Document Analysis and JAD sessions to reduce the Scope Creep and document analysis in requirements elicitation.4\nWorked on all phases of life cycle using Rational unified process (RUP) methodology.\nCreated Business Requirements Documents (BRD) and Functional Requirements Specifications (FRS) documents.\nCreating and managing Project templates, Use Case project templates, requirement types and traceability relationships in Requisite Pro.\nDesigned Use cases, Use case diagrams to present a better view of the system as a whole to the technical team for them to identify the key processes.\nUsed MS Visio for flow charting, process model and architectural design of the application. Used MS Project for status reporting and project planning.\nInteracted with the QA developers on resolving the reported bugs.\nConducted Walkthroughs and User Acceptance Tests (UAT) and worked closely with the UAT personnel to both ensure that their needs are met.\nMarriott International, Inc, St. Louis, MO Feb08-Nov09 Business Analyst\nProject Description\nWorked as a Business Analyst at Marriott. Marriott International, Inc. is a leading hospitality company with over 370,000 rooms, spanning more than 2,000 properties, 58 countries, and 13 lodging brands, including Marriott Hotels, Resorts and Suites; and Renaissance Hotels It Offers international hotel rooms, vacation clubs, and senior living services as a leader in the hospitality industry.\nIt has 3,000 users dispersed across different sales and service functions spanning the globe. It is deployed to more than 2,000 locations. Marriott uses Siebel Systems for its EBusiness solutions for implementing Siebel sales and Siebel business modules. With these goals in mind, Marriott turned to Siebel Systems for its EBusiness solution, deploying Siebel Sales and Siebel eService to approximately 3,000 employees globally. Worked on the testing of the call center, Marketing, ESales modules.Acted as a liaison between stakeholders, system users, clients and managers, who have a business problem and software development, team to gather requirements\nInvolved in defining the project scope, planning the process, estimating the project risks, defining the data models and elucidating the system requirements.\nConducted meetings/interviews and JAD sessions with stakeholders to collect business requirements. This information along with the vision document was used to transform business requirements into System Requirement Specifications.\nGood knowledge of all the interfaces of Siebel CRM including call center, Sales & e-finance.\nInstalled and configured RequisitePro to meet the needs and requirements of the project.\nDeveloped scope and budget for pricing and Implementation planning using WBS and Siebel applications.\nResponsible for defining and documenting System Requirement Specifications/feature requirements and supplementary requirements in RequisitePro.\nCreated and managed project templates, use case project templates, requirement types and traceability relationships in RequisitePro.\nUsed Rational Rose, Microsoft Visio to design Business Use Case Model and Business Object Model.\nCreated Use Case Model and wrote detailed use cases in conjunction with the project team, to define the features of the application, to be used by the development team.\nInteracted with the stakeholders to review and baseline the design documents.\nCalculated the difference between projected outcomes and desired outcomes. Involved in product development phases and performed gap analysis.\nHelped the QA team to devise the test plans for the application by explaining the vision document and the business case.\nAmeri Quest Mortgage Co. Orange, CA\nBusiness Analyst Jan07-Jan08\nProject Description:\nAmeri Quest Mortgage Co. purchases single-family and multifamily residential mortgages and mortgage-related securities, which it finances mainly by issuing debt instruments in the capital markets. The project involved developing a risk analysis and modeling application for the collateral pools that are to be securitized. The loan processing module of the application was redesigned to comply with the changes to the business rules and state policies. It was intended to help the business users to structure the securities based on collateral pool characteristics.:\nPerformed Requirement Analysis by gathering both functional and non-functional requirements based on interactions with the process owners & stakeholders and conducted document analysis.\nResponsible for conducting JAD Sessions with different IT Group department managers & refined the requirements.\nCreated User Requirement Specifications and Functional Requirement Specifications documents.\nCreated UML Diagrams like Use Case Diagrams and Activity Diagrams using MS Visio and created wire frame diagrams.\nDeveloped process flow diagrams in Visio to better explain the business and IT processes to the various teams.\nCreated Requirement Traceability Matrix to keep track of the requirements\nInvolved in Test Case/Test Plan development of based on Business Requirements and user Acceptance Testing and reported the defects using Test Director.\nConducted walkthroughs, User Acceptance Testing (UAT) sessions and supervised the development of User Manuals for customers.\nKey Bank, Cleveland, OH Oct 2006-Dec07\nBusiness Analyst\nProject Description\nCleveland-based KeyCorp is one of the nation's largest bank-based financial services companies. The project was on the on-line mortgage processing system where customers can check their application status, view existing mortgage application, refinance or work on home equity account. Several mortgage tools and calculators were also developed.:\nGathered Business Requirements, interacted with the stakeholders, developers, Project Manager and SME's and facilitated JAD sessions to formulate Business Processes.\nPrepared User Requirements Document (URD) and Functional Requirements Document (FRD).\nDeveloped Use Cases and Use Case Scenarios and visualized those using UML diagrams in MS Visio.\nDesigned the User Interface prototype for the Customer Information System based on the Business and Functional Requirements using MS FrontPage.\nInitiated Impact Analysis to study the feasibility of the IT integration and expected downstream results by identifying and review multiple business scenarios.\nPrepared Business Process Models that includes modeling of all the activities of the business from the conceptual to procedural level. Followed top down, leveled technique for building Business Process Models.\nDeveloped a Traceability Matrix to keep track of the Requirements, Use Cases and Test Cases.\nReviewed Test Plan, Test scenarios inventory and Test Cases to ensure that they meet the requirements.\nAssisted the development team with design and development of the application, provided usability metrics collected from user surveys.\nResolved found bugs with developers and clarified any ambiguities.\nActed as liaison between the senior management and different teams with effective presentations to achieve best results.\nCoordinated walkthroughs and meetings with development team to discuss related issues.\nHasson Company, Lake Oswego, OR Jan2005-Aug06 Business Analyst\nProject Description:\nThe project involved developing a risk analysis and modeling application for the collateral pools that are to be securitized. The loan processing module of the application was redesigned to comply with the changes to the business rules and state policies. It was intended to help the business users to structure the securities based on collateral pool characteristics.:\nPerformed Requirement Analysis by gathering both functional and non-functional requirements based on interactions with the process owners & stakeholders and conducted document analysis.\nResponsible for conducting JAD Sessions with different IT Group department managers & refined the requirements.\nCreated User Requirement Specifications and Functional Requirement Specifications documents.\nCreated UML Diagrams like Use Case Diagrams and Activity Diagrams using MS Visio and created wire frame diagrams.\nDeveloped process flow diagrams in Visio to better explain the business and IT processes to the various teams.\nCreated Requirement Traceability Matrix to keep track of the requirements\nInvolved in Test Case/Test Plan development of based on Business Requirements and user Acceptance Testing and reported the defects using Test Director.\nConducted walkthroughs, User Acceptance Testing (UAT) sessions and supervised the development of User Manuals for customers."}