{"name":"depak dubay","summary":"Over 6 years of extensive experience in business process engineering and software development with expertise in Analysis, Design, Development and Implementation of software applications.\nExtensive experience in diversified industry sectors including Mortgage Industry, Finance, and Investment Banking.\nStrong knowledge of Software Development Life Cycle, Testing Methodologies and Techniques.\nExtensive knowledge of Rational Unified Process (RUP), design using UML, Rational Rose, Requisite Pro, Rational Clear Case, and Visio.","skills":"Operating Systems : Win 95/98/NT/2000/XP","languages":": C, C++\nInternet Technologies : HTML, CGI, Java Script, VB Script\nDatabases : MS SQL server, MS Access\nTools : Word, Excel, Rational Rose, RequisitePro, Rational SODA,\nClearquest\nSoftware : Visual Studio 6.0, VB 6.0, MS- XML 3.0\nSoftware Modeling Tools : UML, Rational Rose 2000, Modeler & Microsoft Visio 2000\nVersion Control : Rational ClearCase\nEMPLOYEE HISTORY\nClient : Ameriquest Mortgage Company\nDuration : 05/2004 – 04/2005\nRole : Business Analyst\nWorked with numerous teams to develop an enterprise Web-based interface supporting the Mortgage Servicing Business Area. This application allowed users to maintain and set-up Account Information, Loan Origination, Escrow Analysis and many other business Areas. Was responsible for gathering and reviewing business requirements, functional specifications, project schedules, documentation, preparing test plans, map current business processes, identify gaps and failure points, perform root cause analyses, and develop functional requirements that support overall strategy, goals and objectives.\nKey activities:\nWorked with the business users to define business requirements and analyze the possible technical solutions.\nWorked extensively with SMEs in understanding and documenting their requirements pertaining to Loan Origination, ARM, Escrow Analysis, ACH based Accounts, maintaining and analyzing customers Accounting books and many other business Areas.\nWorked with the Business users, tech Lead and 3rd party vendors in gathering their requirements and data transaction information related to OLTP, OLAP and ASP.\nCo-author business requirements document with project teams. Extracted, discussed, and refined business requirements from business users and team members.\nFacilitated and managed meeting sessions with committee of SMEs from various business areas including Mortgage Servicing, Loan Monitoring and Asset Management.\nDeveloped and implemented processes and tools for requirements gathering, Analysis, planning, tracking and delivery using Rational Rose requisite pro – RUP\nAnalyzed user problems, including automated and manual business processes and identified, researched, investigated, defined and documented business processes\nDesigned and developed project document templates based on SDLC methodology.\nDesigned and developed Use Cases, Activity Diagrams, Sequence Diagrams, and Collaboration Diagrams.\nAssist project managers with the development of project schedules. Develop requirements and preliminary design for client applications. Perform analysis and design projects using a systems development methodology. Work with all levels of client staff in solution definition.\nConducted workflow, process diagram and gap analyses to derive requirements for existing systems enhancements.\nCollaborated with the QA team to developed the test plan, test conditions and test cases to be used in testing based on business requirements, technical specifications and/or product knowledge\nOrganized cross training of team members and Users to become more responsive.\nAct as a resource in understanding how IS systems carry out business functions and assists in ensuring the timely and effective implementation\nAssisted in development of training materials for new technology and process improvements\nClient : Fleet Bank\nDuration : 03/2002 – 04/2003\nRole : Business Analyst\nEnhanced and modified the productivity of the credit card production core application to reduce the cost of application maintenance and improve productivity. The whole application process has been updated in order to meet the business requirements of the client. Re-designed the core credit card production and billing application, developed a process-centric approach to application maintenance, and provided enhanced documentation of the current system.\nKey activities:\nWas responsible for creating and reviewing business requirements, functional specifications, project schedules, documentation and test plans.\nWorked with production staff to identify and map detailed current processes, identify gaps and failure points, perform root cause analysis and develop functional requirements that supported overall strategy, goals and objectives.\nActed as a liason between the technical staff and the users (staff and management). Also was responbile for communications between Project Team and other related departments.\nAlso involved in content management change control and Version Management. Performed regular updates to various static web pages.\nCoordinate, mentoring of various tools and process flow of the application.\nLead client facilitation meetings to gather requirements (Inception phase), there after assisted tech leads in Analysis & Design of architecture using OOAD approach using UML & Rational Unified Process.\nAnalyze and design Use Case diagrams, Class diagrams, sequence diagrams, Business Objects, Domain Object Model, and Visio to depict process flows and PowerPoint presentations.\nImplemented Traceability Matrix and User Requirement Specification Document (URS) and verified the functionality coverage.\nActed as a resource in understanding how IS systems carried out business functions and assisted in ensuring timely and effective implementation.\nDeveloped timelines for project delivery, and managed projects and resources to successful completion.\nInvolved in developing the test strategy and helped in developing QA Test plans for Functional, Integration and System Testing.\nUsed Test Director to maintain test cases and test scripts.\nPerformed User Acceptance Testing.\nClient : Wachovia Corp.\nDuration : 07/2001 – 03/2002\nRole : Business Analyst\nWachovia Corporation is one of the largest independent commercial banks headquartered in North Carolina. My project was to build an Enterprise Reporting System to support the portfolio management and performance analysis of the credit card business with various reward offerings. The whole application processes were comprised of ETL process for transactional data, Filter process to identify valid transactions, Calculation process for transaction and reward fee calculation, data integration into the Data Warehousing System. The end user interface was a web based OLAP reporting system implemented in Business Objects to provide business intelligence capability to asset manager.\nKey activities:\nServed as a liaison between business team and the project team by assisting the business in identifying, understanding, and documenting their business needs.\nCollected and documented business processes as well as business rules.\nParticipated in the identification, understanding, and documentation of business requirements, including the applications capable of supporting those requirements.\nTranslated the business needs into system requirements, communicating with the business on a non-technical level, and with the System Analyst on a more technical level.\nCollaborated with development architect and the business to develop both high-level and detailed application architecture to meet the business needs.\nIdentified gaps, performed gap analysis.\nDocumented and delivered Functional Specification Document to the project team.\nParticipated in the logical and physical design sessions, developed design documents.\nAssist the PM in setting realistic project expectations and in evaluating the impact of changes on the organization and plans accordingly.\nProvided technical assistance in identifying, evaluating, and developing systems and procedures that are cost effective and meet business requirements.\nDeveloped test scenarios and implemented test plan. Providing key input in working with users in defining project and system requirements.\nConducted project related presentations.\nClient : UBS Financial\nDuration : 07/2001 – 03/2002\nRole : Business Analyst\nFixed income Performance Attribution System (FIPA) was developed specifically to support Wealth Management Groups to provide most valuable advisory services to clients on Asset Projections, Executive stock option models, Portfolio Rebalancing, Investment Holdings, Liquidity needs and future goals. The systems solutions advise the clients on wealth management strategies, provide clear and complete picture of the clients assets in position and those that are held by other providers, full brokerage capabilities, access to IPO's and other 3rd party products, research data and tax and insurance information.\nKey activities:\nConducting user interviews at both in-house and client locations, gathering and analyzing requirements using RequisitePro – RUP\nDesigned and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOD using UML\nIdentify, research, Realize, investigate, analyze, define and document business processes and Use Case Scenarios.\nPerform Gap analysis by identifying existing technologies, documenting the enhancements to meet the end state requirements.\nConduct workflow, process diagram and gap analyses to derive requirements for existing systems enhancements\nAssist with user testing of systems (UAT), developing and maintaining quality procedures, and ensuring that appropriate documentation is in place\nResponsible for identifying and documenting business rules and creating detailed Use Case\nConduct User Acceptance Testing\nWorked with development and testing teams to accomplish timely release objectives.\nUsing detailed knowledge of application features and functions assess scope and impact of business needs throughout analysis and completion of all enhancement specifications\nAct as a resource in understanding how IS carry out business functions and assists in ensuring the timely and effective implementation\nDeveloped timelines for project delivery, and managed projects and resources to successful completion\nLiaison for projects with other corporate departments, including Executive, Legal and Information Services as well as vendor relationships.\nResponsible for all project documentations\nExtensively work on Access, Excel, Word, PowerPoint, SQL, MS Project.\nClient : Commerce Bank\nDuration : 03/2000 – 06/2001\nRole : Business Analyst\nCommerce Bank is the principal subsidiary of Commerce Bancshares Inc. Was involved with managing requirements for converting labor intensive and time taking loan lifecycle process into an automated and integrated system that would provide real time status of applications, risk management and monitoring capabilities. Analyzed steps in loan lifecycle and identified processes for up-gradation and integration. A centralized repository for underwriting and monitoring was built and put in place.\nKey activities:\nAddress all aspects of the loan lifecycle, starting from identifying a deal right up to loan closure\nUsed standard Business Analysis methodology centered on RUP (Rational Unified Process). Responsible for eliciting and gathering business user's requirements.\nDesigned and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOD using UML\nHelped develop use cases, project plans and manage scope.\nAssisted in building a business analysis process model using Rational Rose and Visio.\nPerformed requirement analysis, went through all the use cases and workflows.\nPlayed a key role in the planning, testing, and implementation of system enhancements and conversions\nProvided key input in working with users in defining project and system requirements.\nFunctioned as the primary liaison between the business line, operations, and the technical areas throughout the project cycle.\nAnalyzed research on operational procedures and methods and recommend changes for improvement – with an emphasis on automation and efficiency.\nWorked with a cross functional and diverse team of business users and developers to enable accurate communication of requirements and ensure consensus.\nAssisted with product evaluation, product customization and system integration.\nPerformed analysis on enterprise data / report integration.\nProvided functional specification to development team to build Enterprise Reporting Systems.\nClient : OrthoNet\nDuration : 04/1999 – 02/2000\nRole : Business Analyst\nOrthoNet provides orthopedic services to a number of health and managed care plans in the health care industry. The majority of OrthoNet's client activity was directed and received through a manual fax and printer system. Client records were manually processed, and stored in traditional file cabinets, which was time-consuming, costly and inefficient. The requirement was to integrate and upgrade the processing system and various disparate. The project introduced the document imaging system. These document imaging practices reduce operating costs, optimize workflow, and increase the quality of care.\nKey activities:\nKey activities:\nTo study and assess the clients systems and business processes\nEstablished a business Analysis methodology around the RUP (Rational Unified Process).\nUnderstand the various steps in the lifecycle and then construct the system.\nClerical work processes had to be streamlined and mapped to the automated system.\nProvide the client's management quick and easy access to all current economics (i.e. construction status, leasing status, etc.) of the collateral pertaining to all the loans in the portfolio.\nHelped develop use cases, project plans and manage scope.\nAssisted in building a business analysis process model using Rational Rose and Visio.\nPerformed requirement analysis, went through all the use cases and workflows.\nProvided key input in working with users in defining project and system requirements.\nFunctioned as the primary liaison between the business line, operations, and the technical areas throughout the project cycle.\nAnalyzed research on operational procedures and methods and recommend changes for improvement – with an emphasis on automation and efficiency.\nConducted benchmarking activities to identify best practices.\nAssisted with product evaluation, product customization and system integration.\nProvided functional specification to development team to build Enterprise Reporting Systems.","education":"Masters of Business Administration (MIS)\nBS in Business Administration"}