{"name":"xxx","skills":"Operating Systems\nWindows, Unix (Solaris, AIX), Macintosh\nDatabases\nOracle, My SQL, MS SQL Server\nProgramming/Scripting Languages\nC, VB Script, PERL, HTML, JAVASCRIPT, XML\nDebugging/Testing Tools\nBugzilla, Quality Center, Quick Test Professional (QTP), Load Runner, Rational ClearQuest, SOAP UI, Selenium IDE, Rational Robot\nProject Design & Architecture\nMicrosoft Visio, Rational Requisite Pro, Gliffy, Rational Rose, SharePoint\nOther Tools\nPutty, Toad, VMWare, MS Office\nPROFESSIONAL Experience SUMMARY\nProject\nDomain/Project\nProfile\nDuration\nFar East National Bank, LA, CA\nBanking\nSr. Business Analyst\nAug 2009 – Nov 2010\nDeutsche Bank, New York, NY\nBanking\nSr. Business Analyst\nFeb 2008 – Jul 2009\nBaxter Pharmaceutical, Deerfield, IL\nHealth\nBusiness Analyst\nJun 2006 – Dec 2007\nM&T Bank, Buffalo NY\nRisk Management\nBusiness System Analyst\nJan 2005 – May 2006\nUniversity Credit Union, Los Angeles, CA\nBanking\nQuality Analyst\nFeb 2004 – Dec 2004\nFar East National Bank, LA, CA Aug 09 – Nov 10\nSr. Business Analyst\nFar East National Bank (FENB) was founded in 1974 as the first federally chartered Asian American bank in United States. With total assets exceeding US$2.0 billion, FENB provides both corporate and individual banking services through a total of 10 branches in Los Angeles, Orange County, Silicon Valley, and San Francisco.\nWith the increase in size of operations and structure, there was a need to enhance & customize the standard functionality of its ERP Solution – Oracle's Peoplesoft Enterprise 9.1. Methodology followed – SCRUM.S\nOperating Systems\nWindows, Unix (Solaris, AIX), Macintosh\nDatabases\nOracle, My SQL, MS SQL Server\nProgramming/Scripting Languages\nC, VB Script, PERL, HTML, JAVASCRIPT, XML\nDebugging/Testing Tools\nBugzilla, Quality Center, Quick Test Professional (QTP), Load Runner, Rational ClearQuest, SOAP UI, Selenium IDE, Rational Robot\nProject Design & Architecture\nMicrosoft Visio, Rational Requisite Pro, Gliffy, Rational Rose, SharePoint\nOther Tools\nPutty, Toad, VMWare, MS Office\nPROFESSIONAL Experience SUMMARY\nProject\nDomain/Project\nProfile\nDuration\nFar East National Bank, LA, CA\nBanking\nSr. Business Analyst\nAug 2009 – Nov 2010\nDeutsche Bank, New York, NY\nBanking\nSr. Business Analyst\nFeb 2008 – Jul 2009\nBaxter Pharmaceutical, Deerfield, IL\nHealth\nBusiness Analyst\nJun 2006 – Dec 2007\nM&T Bank, Buffalo NY\nRisk Management\nBusiness System Analyst\nJan 2005 – May 2006\nUniversity Credit Union, Los Angeles, CA\nBanking\nQuality Analyst\nFeb 2004 – Dec 2004\nFar East National Bank, LA, CA Aug 09 – Nov 10\nSr. Business Analyst\nFar East National Bank (FENB) was founded in 1974 as the first federally chartered Asian American bank in United States. With total assets exceeding US$2.0 billion, FENB provides both corporate and individual banking services through a total of 10 branches in Los Angeles, Orange County, Silicon Valley, and San Francisco.\nWith the increase in size of operations and structure, there was a need to enhance & customize the standard functionality of its ERP Solution – Oracle's Peoplesoft Enterprise 9.1. Methodology followed – SCRUM.","languages":"C, VB Script, PERL, HTML, JAVASCRIPT, XML\nDebugging/Testing Tools\nBugzilla, Quality Center, Quick Test Professional (QTP), Load Runner, Rational ClearQuest, SOAP UI, Selenium IDE, Rational Robot\nProject Design & Architecture\nMicrosoft Visio, Rational Requisite Pro, Gliffy, Rational Rose, SharePoint\nOther Tools\nPutty, Toad, VMWare, MS Office\nPROFESSIONAL Experience SUMMARY\nProject\nDomain/Project\nProfile\nDuration\nFar East National Bank, LA, CA\nBanking\nSr. Business Analyst\nAug 2009 – Nov 2010\nDeutsche Bank, New York, NY\nBanking\nSr. Business Analyst\nFeb 2008 – Jul 2009\nBaxter Pharmaceutical, Deerfield, IL\nHealth\nBusiness Analyst\nJun 2006 – Dec 2007\nM&T Bank, Buffalo NY\nRisk Management\nBusiness System Analyst\nJan 2005 – May 2006\nUniversity Credit Union, Los Angeles, CA\nBanking\nQuality Analyst\nFeb 2004 – Dec 2004\nFar East National Bank, LA, CA Aug 09 – Nov 10\nSr. Business Analyst\nFar East National Bank (FENB) was founded in 1974 as the first federally chartered Asian American bank in United States. With total assets exceeding US$2.0 billion, FENB provides both corporate and individual banking services through a total of 10 branches in Los Angeles, Orange County, Silicon Valley, and San Francisco.\nWith the increase in size of operations and structure, there was a need to enhance & customize the standard functionality of its ERP Solution – Oracle's Peoplesoft Enterprise 9.1. Methodology followed – SCRUM.","summary":"Project\nDomain/Project\nProfile\nDuration\nFar East National Bank, LA, CA\nBanking\nSr. Business Analyst\nAug 2009 – Nov 2010\nDeutsche Bank, New York, NY\nBanking\nSr. Business Analyst\nFeb 2008 – Jul 2009\nBaxter Pharmaceutical, Deerfield, IL\nHealth\nBusiness Analyst\nJun 2006 – Dec 2007\nM&T Bank, Buffalo NY\nRisk Management\nBusiness System Analyst\nJan 2005 – May 2006\nUniversity Credit Union, Los Angeles, CA\nBanking\nQuality Analyst\nFeb 2004 – Dec 2004\nFar East National Bank, LA, CA Aug 09 – Nov 10\nSr. Business Analyst\nFar East National Bank (FENB) was founded in 1974 as the first federally chartered Asian American bank in United States. With total assets exceeding US$2.0 billion, FENB provides both corporate and individual banking services through a total of 10 branches in Los Angeles, Orange County, Silicon Valley, and San Francisco.\nWith the increase in size of operations and structure, there was a need to enhance & customize the standard functionality of its ERP Solution – Oracle's Peoplesoft Enterprise 9.1. Methodology followed – SCRUM.","experience":"SUMMARY\nProject\nDomain/Project\nProfile\nDuration\nFar East National Bank, LA, CA\nBanking\nSr. Business Analyst\nAug 2009 – Nov 2010\nDeutsche Bank, New York, NY\nBanking\nSr. Business Analyst\nFeb 2008 – Jul 2009\nBaxter Pharmaceutical, Deerfield, IL\nHealth\nBusiness Analyst\nJun 2006 – Dec 2007\nM&T Bank, Buffalo NY\nRisk Management\nBusiness System Analyst\nJan 2005 – May 2006\nUniversity Credit Union, Los Angeles, CA\nBanking\nQuality Analyst\nFeb 2004 – Dec 2004\nFar East National Bank, LA, CA Aug 09 – Nov 10\nSr. Business Analyst\nFar East National Bank (FENB) was founded in 1974 as the first federally chartered Asian American bank in United States. With total assets exceeding US$2.0 billion, FENB provides both corporate and individual banking services through a total of 10 branches in Los Angeles, Orange County, Silicon Valley, and San Francisco.\nWith the increase in size of operations and structure, there was a need to enhance & customize the standard functionality of its ERP Solution – Oracle's Peoplesoft Enterprise 9.1. Methodology followed – SCRUM.","objective":":\nPerformed GAP analysis to understand the gap between the actual and potential performance or requirements with the sole objective of identifying customization/enhancement needs\nResponsible for conducting the Vendor Analysis\nDetermined and documented the As-Is and the To-Be (future) business process flows and performed return on investment analysis\nInteracted with Stakeholders, SMEs from different business units to gather their concerns and suggestions\nOrganized and conducted JAD sessions at various stages\nCollected, analyzed, organized and documented business Requirements using Rational Requisite Pro\nDeveloped BRDs, Functional Specification and Non-functional Documentations\nDesigned and developed Use Cases, Use Case Diagrams, Activity Diagrams, and state Diagrams using UML techniques\nAssisted the Quality Team in designing the Test Plans, Test Scenarios and Test Cases\nRegular meetings with senior project managers and business sponsors to discuss any technical and operational issues and updates on the current project status\nDeveloped, documented and supervised User Acceptance Test (UAT)\nAssisted in development of User Guides, training materials and SOPs\nProvided professional training to users and user managers\nDeutsche Bank, New York, NY\nSr. Business Analyst Feb 08 – Jul 09\nDeutsche Bank is an international bank with operations spread over 70+ countries. The bank offers various financial products and services such as sales, trading, mergers and acquisitions, risk management, retail banking, wealth management and transaction banking. The project included streamlining the customer's master data using Master Data Management (MDM) methodologies and enhancing the existing data ware house for the subject area of customers. The investment portfolios from Deutsche Bank and other subsidiaries' were merged in to one unified database to provide possibility of the cross selling the combined products of Deutsche Bank. The SDLC methodology followed was Rational Unified Process (RUP) and the solution applied was IBM InfoSphere MDM Server.:\nIdentified the mission statements and stake holders goals\nIdentified and created the existing and expected business flow of the master data usage\nIdentified owners of the master data and appointed data stewards for the MDM system\nCollected and studied the meta data about the master data for MDM and the transactional data\nGathered issues about data-quality and other requirements pertaining to the project with the help of various forums viz. interviews, JAD, brainstorming sessions etc.\nCreated Business Requirements Documents (BRD) and identified high level use cases\nPrepared detailed use cases\nPrepared the requirements and use case traceability matrix\nDeveloped a Master Data Model (MDM) using Erwin\nWrote specification for the modifying and producing Master Data\nIdentified the key sources of Master Data and mapped them to the newly designed model\nDesigned the infrastructure for usage of the MDM by different applications\nMapped data for the ETL (Extract, transfer and load) process and wrote detailed specification for the ETL and Reports\nAssisted in generating the master data and tested the master data\nAssisted in development of ETL programs and resolved issues while ETL\nSupported the UAT for reports, ETL and MDM access\nIdentified the reporting needs for decision makers and helped in realizing the reports needed by managers\nProvided necessary training for transition\nBaxter Pharmaceutical, Deerfield, IL\nBusiness Analyst Jun 06 – Dec 07\nFounded in 1931, Baxter Pharmaceutical, through its subsidiaries, develops, manufactures and markets products that save and sustain the lives of people with hemophilia, immune disorders, infectious diseases, kidney disease, trauma, and other chronic and acute medical conditions. As a global, diversified healthcare company, Baxter applies a unique combination of expertise in medical devices, pharmaceuticals and biotechnology to create products that advance patient care worldwide.\nThe Application under development was a Web based EMR, which provided comprehensive solution to a physician's needs. The HIPAA compliant application integrates with a complete PMS, DMS, LIMS, Data Integration systems, Online Pharmacy Ordering, and many other support systems that an EMR would require to interact with.:\nWhile working on an Agile Methodology (RUP), I was responsible for all project management and project planning activities in co-ordination with the project manager\nGathered Business Requirements, interacted with the stakeholders, developers, Project Manager and SME's and facilitated JAD sessions to formulate Business Processes\nPrepared User Requirements Document (URD) and Functional Requirements Document (FRD)\nDeveloped Use Cases and Use Case Scenarios and visualized those using UML diagrams in MS Visio\nExtensively worked with Portfolio Managers and Experienced Traders in gathering, analyzing and organizing Business Requirements in an SOA Environment\nConducted surveys and questionnaires with the end customers and escalated their concerns to the management to better meet their expectations from a Business standpoint as well as a User Interface usability standpoint\nExtensively worked with modules related to inventory tracking, retail orders, payments and claims\nInitiated Impact Analysis to study the feasibility of the IT integration and expected downstream results by identifying and review multiple business scenarios\nPrepared Business Process Models that includes modeling of all the activities of the business from the conceptual to procedural level. Followed top down, leveled technique for building Business Process Models\nDeveloped a Traceability Matrix to keep track of the Requirements, Use Cases and Test Cases\nReviewed Test Plan and Test Cases to ensure that they met the requirements\nAssisted the development team with design and development of the application, provided usability metrics collected from user surveys\nActed as liaison between the senior management and different teams with effective presentations to achieve best results\nInvolved in different phases of Test effort like Smoke/Sanity Testing, Functional Testing, Regression Testing and UAT\nAcquired the business Sign-Off on the User Requirements Document (URD) and functional requirement document (FRD)\nProvided technical recommendations for concise reporting format\nActively involved in walkthroughs and meetings with development team to discuss related issues\nDocumented best practices in the project for reusability (defect tracking, training, post production)\nM&T Bank, Buffalo NY\nBusiness Systems Analyst Jan 05 – May 06\nEstablished in 1856 as Manufacturers and Traders Bank, today M&T Bank Corporation is one of the 20 largest independent bank holding companies in the U.S. The project included integration of a 3-tier architecture browser based legacy application called Control System with Oracle Identity Management System. The objective of the application was to enforce internal security policies and eliminate potential security threats from rogue, expired and unauthorized accounts and privileges. It further provided a tool to the cryptographic team to keep track of the banker's user profiles and securing their passwords. Also, the applications aimed at reducing inefficiency and improve service levels by automating repeatable user administration tasks.:\nInvolved in writing Test plans, Creating Test scripts, Team Co-ordination and Documentation\nAnalyze system requirements and formulate scenarios in Test Manager for the functionality, navigation, stress, security, recovery and performance testing of the application\nCoordinated quality assurance teams effort in re-creating various production issues in test environment\nDeveloped Test Harness using SQA Basic that contains generic functions for the automation scripts and for testing front-end interfaces\nInvolved in a cross-functional team to improve the customer's \"out of box\" experience; simplifying the product login, increasing customer satisfaction and security and converting more evaluations into real time cost effective solutions\nWrote test cases for positive and negative scenarios for functional and security testing\nPrepared test data for the entrance and exit criteria in integration testing.\nConducted automation Regression Analysis for several internal releases and assisted in automating test cases for regression testing using Robot\nInvolved in Back-End Oracle database verification manually as well as using Rational Robot\nUsed Test Manager to generate load and create scenarios to test the behavior of the applications\nAnalyzed the Transaction results, Virtual User status results and generated reports\nWorked hand in hand with developers in resolving critical issues\nDocumented the defects and their trailing history in the ClearQuest for internal evaluation of the product\nUpgraded / maintained QA databases and automation scripts\nWorked with application design team in learning the UNIX internals and the behavioral characteristics of the network\nDocumented the defects and their trailing history in Test Director\nExtensively used remedy for change and configuration management\nManaged critical paths and bottlenecks in conjunction with Project Tracking Reports for Senior Management with the help of UML and results generated from QTP and LR scenarios from one or 'n' users plugging into the online banking application\nUniversity Credit Union, Los Angeles, CA\nQA Analyst Feb 04 – Dec 04\nUniversity Credit Union (UCU) is a not-for-profit financial institution for employees and families of major Southland Universities. The project included testing a web application that enabled the customers to access their bank accounts online. The customer could view their account details, enroll in for bill payments and add Payees. The application further allowed the account holders to change their profile, address and any personal information online. The website further had a customer service message center where the customers could report any problem with their accounts.:\nResponsible for creating QA Documents including Test Plans, Test Cases and Test Reports\nPerformed manual testing of the application against the functional and business requirements with positive and negative values in an Agile (Scrum) setup\nDeveloped test scenarios around the business rules, to validate the web service requests and integration between different applications. Conducted Sanity testing, system testing and Integration Testing\nIdentified the test scenarios for automation and created Winrunner actions to simulate user actions\nDeveloped adaptable and reusable functions, managed a data driven framework and conducted functionality as well as the GUI tests\nCreated regression suites to be run on application builds\nConducted and participated in user acceptance testing to validate and verify the accuracy of successful completion of Business Processes, functionality, and reporting features\nWrote SQL queries to ensure that data was updated to various tables in the database\nLogged Defects/Bugs in Test Director"}