{"name":"Ritesh Kumari","email":"ritu86.bhargava@gmail.com","phone":"7503050029","education":"AL QUALIFICATION2006 – Bachelor of Technology (Hons), Kurukshetra University2015 – Master of Business Administration(Hons), Narsee Monjee UniversityMobile: +91 7503050029Email: ritu86.bhargava@gmail.comMy profile @ LinkedIn","skills":"Domain Expertise/Specialist - Identity Administration, Identity Governance, Privileged Account Management, Access Management, Single Sign On, Risk Analytics, Multi Factor Authentication, Mobile Security, Integrations (On Premise, mainframes and SaaS)\nOpen Standards – SPML, SCIM, SAML, Rest, OAuth 2.0, OpenID Connect, JWT\nProduct Knowledge –\nOracle IAM- OIM, OIA, OAM, OAAM, OMSS\nSailpoint IAM :- Sailpoint IIQ\nCloud IDM – Oracle Public Cloud, Oracle Identity Cloud Service, Azure, AWS, OKTA, OneLogin, Oracle CASB\nSDLC Process – Agile, Waterfall","experience":"2018- Present – Oracle India, Principal Product Manager: - Defining strategy/roadmap and execution for security/identity for Oracle Identity Cloud covering PaaS and SaaS. My focus is on Identity and Integration aspects of the products where I am driving large integration projects with the vision to onboard 5000+ applications in our catalog. I am working with multiple internal groups to drive IDCS uptake for Fusion Applications, Customer Experience Oracle Cloud (CX) and NetSuite. My responsibilities include defining roadmap and requirements, doing program management, running cross group workshops and executive communication for application catalog. I am also responsible for the successful adoption of these products in the market for which I work with Marketing, Sales and pre-sales channels to help position the product and ultimately making successful and referenceable customers. Also, I am responsible for vendor management for development of application network and responsible for preparing questionnaire for Gartner's and Forrester. List of integration that I manage are listed @IDCS Application Catalog\n2014- Present – Oracle India, Senior Product Manager: - Driving Product Strategy and Roadmap for Identity Connector for OIM and application on boarding framework, Technical Enablement, Conducting beta lab for application on boarding of OIM 12c. In this role, I have worked with a number of customers and partners to provide strategic direction for critical projects. List of connectors that I manage are listed @ OIM Connectors.\nMar 2012-Aug 2014 – Bank of America, Analyst/Solution Architect for Sailpoint IIQ. Lead a team of IAM developers from India, driving solution for Bank of America Security requirement in space of Identity and Access management. My responsibilities included talking to LOBs and gather security requirements Market Research for IAM solutions, Designing multi-thread solution for large data load and certifications as Sailpoint IIQ out of box functionality was taking too much time, Rules & certification for designing and implementation, New reports and enhancing the out of the box report, Data extract tasks, Worked on role designing, Performance issues fix for data load, review access, and reporting, Modified Sailpoint IIQ code to make it more efficient in performance wise for large data, assistance and management of the team whenever there are technical difficulties.\nJul 2011-Feb 2012 – Royal Bank of Scotland, Software Designer/Solution designer for Sailpoint IIQ.\nI have worked as a software designer to implement IAM solution for RBS and enhanced and customized the capabilities of Sailpoint IIQ. My responsibilities included Solution design, Requirement gathering and Analysis, System Integration, Design and Development for various module i.e. reports, applications, rules, role mining, SOD, Data extraction, data export and import and certifications.\nSept 2009-Jul 2011 – Packet Video(NTT Docommo) Senior Software Engineer. My responsibilities were to develop MediaFusion which is a client-server software built on J2EE stack that enables you to rapidly develop and launch on-device portals for rich media services.\nOct 2006-Sep 2009 – Mobera Systems, Software Engineer. My responsibilities were to develop Home automation system for Destiny Network which is a client-server software built on J2EE stack that enables you to remotely control your home from mobile app or desktop client.\nOTHER INFORMATION\nRegularly conducts Oracle Identity Cloud Service and OIG connectors training and webcasts, pre-release demos and represents Oracle as an IAM expert in various events around OIG, Hybrid IAM, Cloud IAM and Cloud Trends. Worked actively with corporate legal for preparing statements of work for various vendors and SaaS integrations."}