{"name":"Sai","summary":":\nEight (8+) years of rich experience in IT Enabled Services with substantial business expertise in front, middle and back office operations across software systems, analysis, design, quality assurance, development, implementation, Training, testing, user training, Operations & support.\nProduced project status reports, liaison with onshore - off shore teams and resolved day-to-day issues with emphasis on change management & handling Change Requests.\nWorked with the QA teams to design test plan, test cases, test scripts. Experienced conducting JAD sessions and as a project liaison negotiating and resolving conflicts during requirements gathering among team members\nHandled various Call Center IT teams, Integration UAT Testing\nProfessional certifications –ITIL foundation, Green belt six sigma, Microsoft Certified Systems Engineer (MCSE)\nHands on experience on Daily/Weekly/Monthly on Reporting of Business Documents/Data Integrity using Quality tools. Technical Trainer/SME on Hardware and Microsoft office Technologies\nDemonstrated professional accomplishments on Data Planning/Mapping/Scheduling/Tracking by SDLC Implementations as a Business Process flow Diagrams/Quantitative skills responsible for, Ad-hoc report generation\nTrainer on Ms office - Excel, Project, Power point, Word & Outlook","experience":"Summary:\nEight (8+) years of rich experience in IT Enabled Services with substantial business expertise in front, middle and back office operations across software systems, analysis, design, quality assurance, development, implementation, Training, testing, user training, Operations & support.\nProduced project status reports, liaison with onshore - off shore teams and resolved day-to-day issues with emphasis on change management & handling Change Requests.\nWorked with the QA teams to design test plan, test cases, test scripts. Experienced conducting JAD sessions and as a project liaison negotiating and resolving conflicts during requirements gathering among team members\nHandled various Call Center IT teams, Integration UAT Testing\nProfessional certifications –ITIL foundation, Green belt six sigma, Microsoft Certified Systems Engineer (MCSE)\nHands on experience on Daily/Weekly/Monthly on Reporting of Business Documents/Data Integrity using Quality tools. Technical Trainer/SME on Hardware and Microsoft office Technologies\nDemonstrated professional accomplishments on Data Planning/Mapping/Scheduling/Tracking by SDLC Implementations as a Business Process flow Diagrams/Quantitative skills responsible for, Ad-hoc report generation\nTrainer on Ms office - Excel, Project, Power point, Word & Outlook","education":":\nPost Graduation: M.B.A– IMT\nGraduation: Bachelor of Computers - 2001\nTechnical Proficiency:\nPlatforms: Windows 7/VistaXP/2000/2003, Red Hat Linux Enterprise4.0, UNIX\n.Databases: SQL Server 6.0, Oracle 8i & PL/SQL\nTesting Tools Quality Centre-HP, Test Director6.0, Quick Test Pro 8.2, Win runner\nSolution System: I Solve Solution system\nCRM Systems: Clarify CRM & HP Open View\nMessaging System: Exchange/Outlook, Lotus Notes, Share point\nQuality Six Sigma Green Belt – Mini Tab\nCertified on GE Management Trainings/Skills Workshops\n7- Habits of highly effective people by Stephen Covey\nPresentation & Facilitation Skills\nDeveloping Self Excellence\nTransition Took Kit\nConference call essentials\nEffective Feedback\nHiring &Coaching Skills\nEngagement: Penske Services, Greenhills, PA Apr 2006 to till date\nSenior Business Analyst - Desktop /Wireless Support\nProject Synopsis:\nImplemented Standard desktop data policy and Wireless setups for all office and home users Used Visio Diagrams for better planning , It involved 22 different Penske helpdesk processes to setup standard Desktop policy/Wireless setups with SLA's and SME's for Laptops for office and Remote users for FTE and seat utilization , It Involved IT Teams like Database, Server Management Network management teams to sync with Penske applications which followed SDLC processes.","skills":"Developing Self Excellence\nTransition Took Kit\nConference call essentials\nEffective Feedback\nHiring &Coaching Skills\nEngagement: Penske Services, Greenhills, PA Apr 2006 to till date\nSenior Business Analyst - Desktop /Wireless Support\nProject Synopsis:\nImplemented Standard desktop data policy and Wireless setups for all office and home users Used Visio Diagrams for better planning , It involved 22 different Penske helpdesk processes to setup standard Desktop policy/Wireless setups with SLA's and SME's for Laptops for office and Remote users for FTE and seat utilization , It Involved IT Teams like Database, Server Management Network management teams to sync with Penske applications which followed SDLC processes.Engagement: Penske Services, Greenhills, PA Apr 2006 to till date\nSenior Business Analyst - Desktop /Wireless Support\nProject Synopsis:\nImplemented Standard desktop data policy and Wireless setups for all office and home users Used Visio Diagrams for better planning , It involved 22 different Penske helpdesk processes to setup standard Desktop policy/Wireless setups with SLA's and SME's for Laptops for office and Remote users for FTE and seat utilization , It Involved IT Teams like Database, Server Management Network management teams to sync with Penske applications which followed SDLC processes.","objective":":\nPerform changes in IT helpdesk methodologies using Data Mappings\nClosely work with project managers, department manager and other teams to define, implement and track consistent high quality reporting with Workflow diagrams for smooth implementation.\nReview helpdesk governance by SLA's and push internal helpdesk standards and methodologies with Process Decomposition\nEnsuring the effective operation of SOE (standard operating procedures) / projects in accordance with Quality methodology and co-ordinate and control of approved tasks\nEnsuring that all projects are documented and controlled using agreed standards and methodology\nSupporting a number of project IT streams and releases for different processes, people and technology deployment with Meetings and Facilitation Skills\nReview of project status with complete project plans, work breakdowns, milestones, schedules and issues logs by using flow chart diagrams\nEngagement: GE Infrastructure Services , PA Dec 2005 to Mar 2006\nRole: Business Analyst - Integration between Two CRM's\nProject Synopsis:\nPlanned and Designed the Integration Process between HP Service Desk and Clarify CRM Tool with Client/Server Architecture for 3 GE Businesses namely GE Equipment Services, GE Consumer and Industrial and GE Infrastructure. This Project rose due to a Business Need that L1 Team should use Clarify and L2 team should use HP Service Desk. Brainstormed and used Expert Judgment to Arrive at Strategy by using Test plans by working out this Implementation and XML code was developed and implemented so that the Data Transfer between Two CRMs was successful , for quality metrics HP Quality center was used for reporting. Upload of documents of two CRM's were done through share point::\nEstablish the knowledge management framework and introduction of tools, templates and practices for managing I solve Techniques\nPrepare project prioritization matrix, arrive at metrics & measurements\nConduct workshops to teach project managers about project management methodologies\nEstablishing effective Project / program Management processes, procedures and tools\nDeveloping Project management capability and provide support for different processes\nDrive the project deliverables and taking a key role in key important application tune up initiatives\nFacilitate, plan meetings and lead trainings for better know how.\nEngagement: GE Infrastructure Services Sep 2003 to Jan 2005\nRole: Business Analyst -\nSix Sigma Green Belt - Accuracy of Contact Details.\nProject Synopsis:\nGE Six Sigma Green Belt Project on Accuracy of Contact Details in Clarify (CRM) with GAL.\nThis is a Certified GE Six Sigma Project. It was undertaken with in GE Infrastructure Business. The Accuracy of employee Contact details was found to be a major Focus Area and this Project was undertaken to address that. It followed the Rigorous DMAIC methodology. Extensive Analysis and measurement techniques were used. Benchmarking was used to decide on the Improvement Target. It achieved 72.5% Improvement in Increasing the Accuracy employee details in clarify. (Clarify resource manager tool) with Global Address list.::\nEstablishing best practices across the organization\nSetup and maintain collaborative IT management environment that includes management dashboard, access to project archives and a reference library including templates\nProcess Leader for a team of Help Desk Analysts, 25 members, for technically supporting IT Managed Services for GE Water & Process Technologies Business.\nLead pioneering effort in the area of K.B.E (Knowledge based engineering). The end product (object oriented) was aimed at creating SOP (standard operating procedures) to enable analysts in providing consistent and better service.\nResponsible for identifying process breaks, training needs and mentoring the team leads for handling helpdesk operations.\nProcess Specialist for the Cisco VPN and Fiber link..\nSOA enabled ITIL framework of support, specialist for Multi vendor services operating out of India, hands on experience with Lean & six sigma methodologies to ensure quality oriented service delivery & capturing upcoming business opportunities and their conversion\nDirect reporting team of 8 people with GE Multi Vendor Services\nFormulation of Training, devising Learning Paths, and Process Specific Analysis"}